[
    {
        "name": "Samsung Galaxy Buds Live Bluetooth Truly Wireless in Ear Earbuds with Mic, Upto 21 Hours Playtime, Mystic Black",
        "reviews": [
            {
                "title": "these are 'on the ear' buds",
                "date": "Reviewed in India 🇮🇳 on 4 May 2023",
                "rating": "4.0 out of 5 stars",
                "text": "fitting is a problem for some time but once you figure it out, then its amazing.premium to hold.sturdysound quality- 8/10touch and feel- 8/10Fit and finish - 10/10noise cancellation - 8/10 (mic)on call and 2/10 while listening to musicjust one cons is these are IPX2 WATER RESISTANT.ITS A STEAL DEAL AT ANY PRICE UNDER 5K. (COMPARING WITH OTHER HEADSETS )"
            },
            {
                "title": "Must know before buying",
                "date": "Reviewed in India 🇮🇳 on 11 April 2023",
                "rating": "4.0 out of 5 stars",
                "text": "I'm writting this review after using it for 3 months or so. Please note that this are my opinion of the product.1. Looks- the looks are nice it but will looks wierd after sometime u wear it as it tends to get loose.2. Comfortable- not very comfy and is hard to sleep with as the buds itself gets in yur ear.3. Sounds- the sounds are great even though it is not sealed.4. Noise cancellation- doesn't work that much as it is not sealed in yur ear but works.5. Battery- it is an average to other buds6. Durability- seems very solid to me i think it will atleast last u 2yrs.7. Sensitivity of touch- the touch are a little buggy but I got used to it.9. Value of money- it's fine for me as I got at a discount for only about Rs2800, if it's original price it's a down 👎 for me.I make this review hoping that it helps u out as I also search for a review like this for what I want to order."
            },
            {
                "title": "Comfortable and good sound",
                "date": "Reviewed in India 🇮🇳 on 24 April 2023",
                "rating": "4.0 out of 5 stars",
                "text": "Sound cancellation works good and really makes a difference but ofc the fit is not plugged in ear so there’s a bit variability else the fit is comfortable for long periods of use and good battery and and and AND!! Good xp XD"
            },
            {
                "title": "Decent sound stage!",
                "date": "Reviewed in India 🇮🇳 on 16 April 2023",
                "rating": "4.0 out of 5 stars",
                "text": "Pro: pretty decent sound stage. Sounds loud enough.Con:1. ANC is not great2. Calling mics do not do justice - sometimes too much ambient noise & other times ok ok call quality inconsistentlyAll in all, if a good deal in below 4k inr, and well balanced music is your requirement, buy it. Calling isn't great with most of the TWS anyway, but if that's your reason to buy, do a bit more of research."
            },
            {
                "title": "Clear and crisp sound",
                "date": "Reviewed in India 🇮🇳 on 2 May 2023",
                "rating": "4.0 out of 5 stars",
                "text": "Sound output is ok. Bt little bit more would have been better. Over all satisfied with the product at price of 3500"
            },
            {
                "title": "Nice product. But may not fit everyone's ear.",
                "date": "Reviewed in India 🇮🇳 on 22 April 2023",
                "rating": "4.0 out of 5 stars",
                "text": "It is a good product no doubt.Pros: The sound is good. But you must adjust the device in your ear properly to enjoy the sound.Cons: The range of Bluetooth is not too strong. But, as long as your phone is within a short range, it is no problem."
            },
            {
                "title": "Very good design. Minor glitches",
                "date": "Reviewed in India 🇮🇳 on 20 April 2023",
                "rating": "4.0 out of 5 stars",
                "text": "Works well on android and iOS devices. Noise cancellation is moderate. Good sound quality.Minor irritants like sync issues with galaxy app and touch response."
            },
            {
                "title": "Great product",
                "date": "Reviewed in India 🇮🇳 on 22 April 2023",
                "rating": "4.0 out of 5 stars",
                "text": "This is a very good product but considering its cost, I think other indian brands are also giving a tough compitition at very low prices."
            }
        ]
    },
    {
        "name": "Jabra Elite 45h, On Ear Wireless Headphones with Mic, Fast Charging & Up to 50 Hours of Battery Life, Superior Sound with 40mm Speakers, Compact & Lightweight - Titanium Black, Designed in Denmark",
        "reviews": [
            {
                "title": "Good Bluetooth headset for Office",
                "date": "Reviewed in India on 12 April 2023",
                "rating": "4.0 out of 5 stars",
                "text": "Jabra headset is a good one for office.  I bought this headset to get some freedom to walk around while being on calls for hours.  This does provide that comfort but I have my suspicions on the noise canceling abilities as I have heard team members complain of background noise from my end in calls while using this headset.  But you can mute the call using this headset and unmute when you need to speak so overall serves the purpose and will definitely recommend to all office users to get one.  But find yourself a peaceful place else you might be in for some bad feedback at the other end."
            },
            {
                "title": "Impressive Mic and Sound. Design could have been better",
                "date": "Reviewed in India on 1 May 2023",
                "rating": "4.0 out of 5 stars",
                "text": "Puffs are not so premium. Overall build is good. Its ideal only in sitting arrangement for work/calls/leisure. Not ideal/intended for movements like walking /running, workouts as the ergonomics are not designed for that."
            },
            {
                "title": "Super",
                "date": "Reviewed in India on 30 April 2023",
                "rating": "5.0 out of 5 stars",
                "text": "Bought this since I needed to work from home abroad and could not bring the one I had but as soon as I come back home I will use only this one since it is wireless so I can move freely and most of all I only charged it the day I got it and it is still 70% charge after using it for 5 days of full meetings and calls and I even used it after to listen to music from my phone where it even has the app. Worth all the money."
            },
            {
                "title": "Jabra Elite 45H- A Great Product that is very much underrated.",
                "date": "Reviewed in India on 11 October 2020",
                "rating": "5.0 out of 5 stars",
                "text": "My review is after 2 months of intense use. First of all, it is regrettable that this product is not well received inspite of offering so many features at a reasonable cost. So just as an happy customer of this product, I want to do some justice by writing a honest & a practical review of this product. Definitely this product deserves a better treatment.Also I wanted to clarify certain features of this product which is misunderstood as a defect/ not existing.For many years I was very uncomfortable using wired headphone as the wires get tangled & can't stretch or move away from laptop.But still I kept myself away from a bluetooth headphone because of the following reasons:1.Battery capacity is vey less & it has to be charged frequently & for long hours incase of exhausted battery2.Mic is not good for mobile voice calls3.Very uncomfortable & painful after 2-3 hours of use (From the reviews for most of the very good brands)4.Not very much compatible with office meeting softwares like Skype/Webex5.Connecting single wireless headphone for both mobile & laptop is not that simple6.Bluetooth connectivity not seamless7.Range not good8.Sound quality is not that great compared to wiredNow that I work from home for the past 6 months, there is a greater unavoidable need for me to use phone & laptop alternatively/simultaneously for all my voice interactions with the team for extended hours. Also working from home made me to listen to music quite often ( which was not the case before) .All these forced needs, made me to lookout for a wireles headphone with1.Multi device connectivity & ability to switch  between the devices easily2.High battery capacity & Fast charging3.Good mic for voice calls on mobile/laptop4.Compatibility with Skype/Webex calls5.Comfort for long hours6.Seamless Bluetooth connectivity7.Better Bluetooth range8.Good sound signature9.Last but not least , affordableI found Jabra Elite 45H as the best fit for all my above expectations. I'm really happy to have bought this product.Some highlights of the product from my personal experience (Android 10 Phone, Dell Business Laptop with Win 10, Skype , WebEx ):. Bluetooth 5.0 - Quick & uninterrupted connection. I  could listen to the music when the  connected headphone & the mobile(Bluetooth 5.0)  are in different floors.. Doesn't support AptxHD. 40 mm Drivers - 24 bit Audio sounds great.Bass is  little soft compared to what I expected. But  for long hours usage , it is good to have soft bass.. 50 Hours battery - 15 min. of quick charge gives  10 hrs & Charges 100% in 90 minutes..  No 3.5mm jack . Can't be used in wiredmode.. 2 mics- Good Indoor call quality. Sleepmode time adjustment saves battery well. Voice Assistants - Works very well when connected  to phone only.. Voice based notification.Ex: Battery , Connected.. Soundscapes ( preloaded sounds like bird songs,  rainy day, waterfall, caverns etc).I like it.. Memory foam as earcushion- Soft. I could use it  continuously for 6-7 hrs daily.. Lightweight.. Firmware update through App.Did an update.. 2 yr warranty against rain and dust. Good looking Copper BlackSome reflections on other's review comments:1. \" I hear voice echo\"- It's not a defect. It's a feature  to listen to our own voice to know what other's  will hear.It can be disabled through the app.2.\"Headband is not adjustable\"- I'm not sure if I  misunderstood the statement.Headband is  actually adjustable i.e you can pull/extend the  earpad to suit your head profile.3.\"Headband is loose\"- It might not be a good fit for  small head profiles.4.\"Sound bleeds\"- As it doesn't have Active Noise  Cancellation, it doesn't provide complete  insulation from surrounding sounds.5. \"It doesn't connect to my laptop without  Bluetooth. It's a waste. \" - Please buy a Bluetooth  adapter from TP link to use such headphones. It's  not the fault of the product.I've just shared my expectations vs experiences for this product. If your requirement is similar, this is definitely a great product to look for. Well done Jabra !!!"
            },
            {
                "title": "One of the best at this price if taking calls is also your priority",
                "date": "Reviewed in India on 23 October 2022",
                "rating": "4.0 out of 5 stars",
                "text": "This is one of the best headphones in the market at this price, especially if taking calls is also your priority. Its highlights are excellent mic and battery life! Here are my feedbacks:Pros:1. One of the best mic and sound quality offered during calls. If you are looking for a suitable wireless headphone that has decent noise cancellation and high call quality, this one is surely a choice. Provides pretty impressive audio quality too (Being a casual listener, I have felt the quality is good enough)2. Very good battery capacity. I have used it for hours attending calls, listening to videos and songs, only to be charged hardly once a week! I turn it off when not in use, but this will also go to auto-sleep mode which can be configured through the app.3. App based control and settings which makes it easier to set up and customize your personalized sound effects.Cons:1. Not suitable to be used while running or during work outs. This one fits perfectly for me but not enough to stay tight during workouts. This might obviously depend on the head size."
            },
            {
                "title": "Decent product but has started disintegrating",
                "date": "Reviewed in India on 23 May 2022",
                "rating": "4.0 out of 5 stars",
                "text": "I bought this pair in October 2020 and have been using this regularly. I use this product for work. Here is my long term review.Pros:1. Battery life is amazing. I can go through my entire work week without needing to charge these. That is about 6-7 hours of calls every day. And the battery performance has not deteriorated over time.2. Call quality is good. The mics do a great job focusing on my voice and drowning out other sounds.3. The headphones sound good to me. I am not an audiophile, though.4. Does not have ANC, but the on the ear design does a decent job blocking out most external noise.5. Decent bluetooth range.Cons:1. The biggest issue I am having is with the build quality. It hasn't been 2 years yet and the cushioning on the right ear is disintegrating (pics attached). Had definitely expected this product to last longer2. Some minor glitches when switching between conferencing apps. Sometimes the mic stops working when I switch from a Zoom call to a Google Meet. Starts working when you switch off and on.3. Have also faced some issues with the mute button while using Google Meet. Instead of muting me on the call, the button seems to mute me in windows. Have to unmute from the system sound settings. Not a pleasant experience when in a call.Overall, this is a decent product. Value for money at 5.5k mark. But if you are a moderate to heavy user, do not expect to get more than 2 years out of these."
            },
            {
                "title": "Average sound, very uncomfortable to wear, keep losing their connection. Not recommended.",
                "date": "Reviewed in Australia on 7 August 2021",
                "rating": "1.0 out of 5 stars",
                "text": "Based on some favourable online reviews I bought these Jabra Elite 45H wireless headphones to replace my elderly Sennheisers.  They are solidly made, come with a comprehensive app with user adjustable sound settings, have a superb battery life, and are good value for a pair of full range, on-ear headphones.  However, I'd also read that they have some serious downsides, and these quickly made them completely unusable for me.  I found the sound quality to be good but not great.  The frequency band adjuster and pre-sets in the app helps to tailor them, but they're still a bit fuzzy and certainly not hi-fi quality.  The headband is quite small and stiff, and even at their full extension they were a tight fit, and the soft plastic earpads quickly made my ears hot.  After about an hour they became just too uncomfortable and I had a mild headache from wearing them.  However, the big problem for me was that whether with my fairly new LG TV or my big ipad, they kept losing their bluetooth connection.  Easy enough to reconnect by switching them off and then on again, but it was really annoying to be sitting watching the olympics, only to have the sound suddenly cut out without warning.  Since other reviewers have commented on this seemingly intermittent fault, I assume it is just poor design of some sort.  The Jabras look good on paper but I found them to be too tight to wear comfortably, and with the sound disappearing every so often, I would say 'try before you buy'.  Not recommended."
            },
            {
                "title": "Great but not for laptops or PCs",
                "date": "Reviewed in Australia on 5 May 2021",
                "rating": "3.0 out of 5 stars",
                "text": "Great sound overall. Works well for music and calls on mobile device but not very suitable with laptops. Loses connectivity with laptop after few minutes. Called Jane’s and it’s a known issue - they should declare this issue to the consumer. Buyer beware! Have send this feedback to them and have received no reply."
            },
            {
                "title": "A Quality Product",
                "date": "Reviewed in Australia on 2 April 2021",
                "rating": "4.0 out of 5 stars",
                "text": "I am no expert in the audio fidelity, however, to me the sound that it reproduces made me feel like I am at the theatre which is great. I can hear the outside noise which is ok to me hence there is no noise cancelling feature I can live without that. The added feature is the software you add to your device which you can customise you audio settings. I think it is well made product the only drawback is when you want to take them off temporarily onto your shoulder the headphone can only face outwards I consider this a design fault. They do folder nicely into a pouch makes it to carry for travelling. I have no hesitation in recommending this to anybody interested in acquiring an on ear headphone."
            },
            {
                "title": "Good performance  for the price",
                "date": "Reviewed in Australia on 21 November 2021",
                "rating": "5.0 out of 5 stars",
                "text": "Good headset, highly recommended  for WFH use. Excellent battery life, and charges very quickly. This doesn’t have active noise cancelling, so obviously sound quality can’t be compared with the higher range ANC headsets, but it does its job well for its price point. The mic is particularly good & sensitive. The headset is surprisingly comfortable to wear as well."
            },
            {
                "title": "Does not work with PCs and is not foldable",
                "date": "Reviewed in Australia on 28 May 2022",
                "rating": "1.0 out of 5 stars",
                "text": "Tried to connect with several laptop brands and did not work with any of them so only buy to use with a smart phone. I don't know what they are advertising as foldable because nothing folds on mine. Very disappointing for the price - won't buy Jabra again"
            }
        ]
    },
    {
        "name": "Koss KSC75 Wired On Ear Headphone Without Mic (Black)",
        "reviews": [
            {
                "title": "Overall good",
                "date": "Reviewed in India 🇮🇳 on 26 February 2023",
                "rating": "4.0 out of 5 stars",
                "text": "It is slightly delicate... The sponge part started coming off after about half a year...(But I used it daily rigorously)"
            },
            {
                "title": "nice, but it died far too early.",
                "date": "Reviewed in India 🇮🇳 on 27 February 2023",
                "rating": "3.0 out of 5 stars",
                "text": "The audio quality was nice, cable was below average but its lifespan was dreadful. I bought this in Oct 2023, and it lasted till Feb 2023. 4 months. It died in 4 months. wtf"
            },
            {
                "title": "Old is Gold (All genre headphone)",
                "date": "Reviewed in India 🇮🇳 on 24 January 2023",
                "rating": "5.0 out of 5 stars",
                "text": "Great Sound Quality,This clip on headphone is more than a Decade old and it still stands as one of the best in its price range.Only thing is this product is at quite higher price if you want to buy in India.Tips:If you want it to Last longer, I recommend to go for MMCX mod (YouTube it)"
            },
            {
                "title": "Worth it",
                "date": "Reviewed in India 🇮🇳 on 13 January 2023",
                "rating": "5.0 out of 5 stars",
                "text": "Finely tuned very light stress on ears and worth the price"
            },
            {
                "title": "Good sound quality",
                "date": "Reviewed in India 🇮🇳 on 18 September 2022",
                "rating": "5.0 out of 5 stars",
                "text": "Good sound quality in clip on type. Can wear it for long time. Feels little heavy on the ears during prolonged usage"
            },
            {
                "title": "Lee's money more sound",
                "date": "Reviewed in India 🇮🇳 on 13 July 2022",
                "rating": "5.0 out of 5 stars",
                "text": "Initially problem in wearing after some time it was.perfect"
            },
            {
                "title": "Great Headphones for the price!",
                "date": "Reviewed in India 🇮🇳 on 12 December 2016",
                "rating": "4.0 out of 5 stars",
                "text": "Amazing headphones for the price. You might find yourself hearing sounds that you've never noticed before when you're listening to music. Bass can easily be improved by tightening the clips and bringing the drivers closer to your ear. The treble can be very sharp and almost painful, especially at the beginning. After a bit of burning in, it gets a lot better. Cymbals still sound kinda weird. Might update in a few weeks.Look them up on head-fi for a detailed review.The clips are metal so you can bend them a little bit to get a perfect fit. These are very, very comfortable, and also very moddable.I will almost definitely rebuy these if/when my current pair breaks."
            },
            {
                "title": "No matter what your budget, you should get these.",
                "date": "Reviewed in India 🇮🇳 on 21 April 2018",
                "rating": "5.0 out of 5 stars",
                "text": "No matter what your budget, you should get these. Even if you have 20k to spend on Headphones, buy these(I got mine for 1500) and get a headphone for the remaining amount. They sound great for the price. Once you are able to get them on your ears properly, you can use them for hours on end without feeling any fatigue. Build quality and packaging is where this is lacking but I won't reduce the score because of how good these headphones are. The bass is not overwhelming, it's just right. Overall, I'm a fan of these and i haven't touched my Sennheiser Momentum in-ears since I have got these KSC75's."
            },
            {
                "title": "So cheap but sound pretty good.",
                "date": "Reviewed in the United Kingdom 🇬🇧 on 1 February 2023",
                "rating": "4.0 out of 5 stars",
                "text": "Having read many reviews of these headphones I thought I'd try them out as they could easily be returned if they proved poor and if they failed later it wouldn't be the end of the world at this price.No hype, sound reproduction surprisingly satisfactory, in fact pretty  good at all volumes without distortion and very even reproduction through all frequencies.Used with multiple sources from phones, tablets, DAPs and DAC amps.It's no surprise that they have been in production since the 1980's, the drivers are excellently optimised.The ear clips, rather than the more usual headband are OK if you are happy/able to use them. They are flexible enough to be formed to your needs to establish satisfactory ear positioning and silicon rubber sleeved for comfort.These earphones weigh virtually nothing and are comfortable enough to wear for extended periods if you have the earclips adjusted appropriately.The drivers are open backed so there is virtually no sound isolation, easy to hear external sounds, conversations etc even at moderately loud volumes, sound bleed is quite evident at moderate volume levels and very obvious at higher volume levels. So these are not the best for crowded offic, social settings or group travel unless, used at moderately low volumes (they're fine for me at \"moderate\" volumes).I've compared them with various full size headphones and many items (from Sennheiser, Sony to KZs) and found them not to be wanting in volume or sound quality.They are not what you could call highly \"robust\" with very light gauge fixed leads, so if you're clumsy, heavy handed or careless with them they'll not last long, as usual YMMV but at this price tier not a disaster.Carried out usual mods, added cheap adjustable headband and alternate foam ear pads, there are more radical mods, but I'm happy as they are.In conclusion if you want cheap and cheerful, simple design, lightweight with very good sound reproduction these are a no brainer."
            },
            {
                "title": "Sonido espectacular en un diseño horrible",
                "date": "Reviewed in Mexico 🇲🇽 on 16 August 2019",
                "rating": "5.0 out of 5 stars",
                "text": "Si, son feos, pero reproducen un sonido que compite con productos que cuestan 10 veces mas, y no, no estoy exagerando.Lo bueno:. El sonido, simplemente incredible, el rango y detalle son cercanos a grado hi-fi, nunca había escuchado bajos tan agresivos ni voces tan claras, ni agudos tan definidos en un conductor de este tamaño.. Relación calidad-precio, estos pequeños audífonos son lo mejor que puedes comprar con menos de $400, tan simple como eso, de hecho, son lo mejor que puedes comprar por el doble, triple, no hay competencia.. Portátiles, son muy ligeros y pequeños, los puedes llevar en la bolsa de la camisa, el cable es lo suficientemente largo para el uso de escritorio, pero no tanto para ser estorboso.Lo malo:. Están bien feos. Este diseño no se ha actualizado desde mediados de los 90s, y ya era feo en ese entonces. El clip es de metal cubiérto de plástico traslúcido. Una cara que solo John C. Koss puede amar.. El buen sonido se debe a que la cubierta deja pasar el aire, esto hace que se puedan apreciar frecuencias bajas con poder, pero el precio a pagar es que todos a tu alrededor pueden escucharte y tu a ellos, ya que existe ningún tipo de aislamiento.. La comodidad compromete la calidad de sonido, entre mas ajustado tengas el clip, mejor sonido tendrás, pero será mas cansado para tus orejas. Muchos usuarios cambian los clips por diademas (es sencillo hacer la modificación si consigues una diadema independiente) pero esto desafía el propósito deportivo.En conclusión, los KSC75 no son la mejor opción en cuanto a moda y confort, para eso son los beats o skull candy, pero su sonido es tan bueno y su precio tan accesible, que lo demás no importa, la pura curiosidad justifica el gasto."
            },
            {
                "title": "Good for Oculus Quest 2",
                "date": "Reviewed in the United Kingdom 🇬🇧 on 4 June 2021",
                "rating": "5.0 out of 5 stars",
                "text": "There's a non zero chance you are here looking for something to work with an Oculus Quest 2 as these will come up as recommendations on various Reddit threads.  It is why I bought them and this review is from the perspective of using them exlusively for this purpose.First off you will need to do some cable management as the annoyingly thin cable is a bit too long but once you've got something sorted you can easily store these slipped over a strap with the headset.  Some have suggested cutting the wire stripping and splicing and taping it up to the proper length but that feels likely to end in tears to me.  YMMV.When you are ready to use them they can dangle freelhy until you get the headset on and it is then easy to run the left one around the back of the set and slip them over your ears.  They are vey comfortable and it is easy to forget you even have them on.Sound quality is perfect for playing the various rhythmn games and they keep some airflow to your ears to stop you over heating too much.An advantage over these is unless you are pumping them full volume you will retain some awareness of your surroundings.  This can be handy to avoid stepping on children, pets or spouses.Having them dedicated to the headset is a perfect way to go as you can now just grab the set and controllers without worrying about a fourth thing.  I've seen photos were people have them integrated with the straps. I tried this and it didn't work for me as the phone wasn't properly aligned to my ear so it sounded weak.  Once again YMMV but I would say leave them dangle as it isn't too much effort to put them on and off.There probably isn't anything that is as suitable and this price or less that I am aware of.  All the other types are in ears which will block you awareness of outside the game.  Feels like asking for trouble to me while in VR."
            },
            {
                "title": "Great sounding clip style headphone",
                "date": "Reviewed in the United Kingdom 🇬🇧 on 16 September 2022",
                "rating": "4.0 out of 5 stars",
                "text": "I recommend everyone to try these.But - they are extremely open, so if you want to listen to music in a quiet office then forget these, it'll sound like you've got a tinny phone speaker on low to everyone in the room.  But the openness gives a really decent sound, a lot of detail, and quite bassy.They are impressive.But, the construction is laughably bad.  The ear clips are always coming unclipped from the headphone.  The plastic looks like the lowest grade plastic manufactured.  The styling is goofy af.  The \"comfort upgrade\" that the 75 added over the 35, is that now your entire ear is now only pincered by a steel spring between cheap hard plastic, the spring itself, and this clear unforgiving hard silicone rubber.  So I can only imagine when it was just all hard plastic.So yeah, like a few other Koss products, it sounds great, but it feels like wearing a torture device, but it sounds great so you should try em out.  They are very loud too btw.But...  they are still worth getting, even if only to have on when you have a dance around the house."
            },
            {
                "title": "Unglaublicher Klang",
                "date": "Reviewed in Germany 🇩🇪 on 27 November 2018",
                "rating": "5.0 out of 5 stars",
                "text": "Ich bin in Sachen low budget Sound seit vielen Jahren ein großer Fan der Porta Pro von Koss. Jedoch ist der Sound schon ziemlich basslastig und ein wenig matschig. Nach viel Onlinerecherche bin ich dann auf die KSC75 gestoßen, die mittenbetonter und generell offener klingen sollen als die Porta Pro. Und genau das kann ich bestätigen. Der Sound ist nochmal um einiges ausgewogener und kann sich locker mit der Konkurrenz aus der 200-300 Euro Liga messen.Auf die Ohrbügel hatte ich keine Lust. Aber ich habe mir von Amazon.com einen Billig-Kopfhörer schicken lassen (von Parts Express), dessen Kopfbügel sich perfekt mit den KSC zusammenklicken lässt (siehe Foto).Ergebnis: ein atembemberaubend gut klingender Kopfhörer im billigen Walkman-Look :) Ich bin endlos begeistert"
            }
        ]
    },
    {
        "name": "Redmi SonicBass Wireless In Ear Earphones with Mic Noise Cancellation, IPX4 Splash & Sweat Proof, Multi-Point Dual Pairing, Light-Weight Neckband, Bluetooth 5.0 & Up to 12 hrs of Playback Time (Black)",
        "reviews": [
            {
                "title": "Ok",
                "date": "Reviewed in India on 5 April 2023",
                "rating": "4.0 out of 5 stars",
                "text": "Ok"
            },
            {
                "title": "Worth for the price",
                "date": "Reviewed in India on 15 March 2023",
                "rating": "4.0 out of 5 stars",
                "text": "Sound quality and bass are ok with this price"
            },
            {
                "title": "Perfect and awesome",
                "date": "Reviewed in India on 12 March 2023",
                "rating": "4.0 out of 5 stars",
                "text": "Awesome product happy to purchase, nice sound quality perfect battery to use ☺️"
            },
            {
                "title": "Koi khas nhi",
                "date": "Reviewed in India on 3 May 2023",
                "rating": "3.0 out of 5 stars",
                "text": "Bakwash hai.Sound achha nhi hai bat krte samay."
            },
            {
                "title": "Not bad",
                "date": "Reviewed in India on 6 April 2023",
                "rating": "3.0 out of 5 stars",
                "text": "Simply waste"
            },
            {
                "title": "Conting is some time in closed",
                "date": "Reviewed in India on 31 March 2023",
                "rating": "3.0 out of 5 stars",
                "text": "Can not conating in some time closed"
            },
            {
                "title": "Battery backup is not good",
                "date": "Reviewed in India on 25 March 2023",
                "rating": "3.0 out of 5 stars",
                "text": "Battery backup is not good.Sound quality is good."
            },
            {
                "title": "Super sound",
                "date": "Reviewed in India on 17 February 2023",
                "rating": "4.0 out of 5 stars",
                "text": "Best redmi tnks"
            }
        ]
    },
    {
        "name": "CrossBeats Roar Hybrid ANC Headphones with 35db Active Noise Cancelling, Bluetooth Wireless Over Ear Headphones, 70hours Playtime,Fast Charge, Ambient Sound Mode,40mm Driver, Built-in Equalizer Black",
        "reviews": [
            {
                "title": "Good Quality",
                "date": "Reviewed in India on 5 April 2023",
                "rating": "4.0 out of 5 stars",
                "text": "Sound Quality,ANC and Build quality is perfect for this price range.Also comes with Aux Cable.Call quality is badCannot use for long hours as it is quite tight on ears."
            },
            {
                "title": "Value for money",
                "date": "Reviewed in India on 5 May 2023",
                "rating": "5.0 out of 5 stars",
                "text": "Sound is too smooth and High battery backup"
            },
            {
                "title": "Excellent Product",
                "date": "Reviewed in India on 4 May 2023",
                "rating": "5.0 out of 5 stars",
                "text": "Good cushion and clarity of sound. Quick connectivity."
            },
            {
                "title": "just my opinions",
                "date": "Reviewed in India on 3 May 2023",
                "rating": "3.0 out of 5 stars",
                "text": "sound quality:- below averagesound level :- lowbass - awesomeANC :- below average as the normal mode is betterbuild quality is good but at 3500 price range its not good enough to buy"
            },
            {
                "title": "Best product for the Budget",
                "date": "Reviewed in India on 5 May 2023",
                "rating": "5.0 out of 5 stars",
                "text": "Best headphones on the budget range.Perfect for work and GYM. Super comfy and reliableGood ANC in the segmentValue for money, 💯 recommended"
            },
            {
                "title": "Great experience",
                "date": "Reviewed in India on 5 May 2023",
                "rating": "5.0 out of 5 stars",
                "text": "It’s really good experience with the Crossbeats roar headphone.Mainly it’s bettery back up and effects for bass are on another level."
            },
            {
                "title": "Cross beat headphones",
                "date": "Reviewed in India on 4 May 2023",
                "rating": "5.0 out of 5 stars",
                "text": "I'm happy wifh this product, very good sound quality and product quality is superb. Go for this if you want to get good Bluetooth headphones"
            }
        ]
    }
]