[
    {
        "name": "Apple EarPods with 3.5mm Headphone Plug",
        "reviews": [
            {
                "title": "Quality",
                "date": "Reviewed in India 🇮🇳 on 26 April 2023",
                "rating": "5.0 out of 5 stars",
                "text": "I bought this for android phone should quality is 5/5 but you can't control volume because its only work in iphones"
            },
            {
                "title": "The best earphones on this planet!",
                "date": "Reviewed in India 🇮🇳 on 16 January 2023",
                "rating": "4.0 out of 5 stars",
                "text": "If you can invest the money into it, I would definitely say go for it! It’s the best and by far one of the best sounding earphones!"
            },
            {
                "title": "Worth product",
                "date": "Reviewed in India 🇮🇳 on 19 January 2023",
                "rating": "4.0 out of 5 stars",
                "text": "Sound quality is much better than many of TWS"
            },
            {
                "title": "Good buy",
                "date": "Reviewed in India 🇮🇳 on 9 January 2023",
                "rating": "4.0 out of 5 stars",
                "text": "Nice product"
            },
            {
                "title": "These are original earphones",
                "date": "Reviewed in India 🇮🇳 on 26 April 2023",
                "rating": "5.0 out of 5 stars",
                "text": "These are original headphones, have been using it for last 2 months and are working fine and sound is just perfect."
            },
            {
                "title": "Ok Type",
                "date": "Reviewed in India 🇮🇳 on 6 March 2023",
                "rating": "3.0 out of 5 stars",
                "text": "The quality is not like original one. At the time of calling a shrill sound is coming which very annoying."
            },
            {
                "title": "Apple ka hai , sahi hai",
                "date": "Reviewed in India 🇮🇳 on 26 April 2023",
                "rating": "5.0 out of 5 stars",
                "text": "Got the original earphones , was kind of skeptical before buying. It’s good!"
            },
            {
                "title": "Affordable and very good qualiity",
                "date": "Reviewed in the United Kingdom 🇬🇧 on 11 March 2023",
                "rating": "5.0 out of 5 stars",
                "text": "I have used these for years and is the main reason why I will never buy AirPods. These are afforable, great quality and you will never drop them like pods and lose them."
            },
            {
                "title": "Official apple earpods",
                "date": "Reviewed in the United Kingdom 🇬🇧 on 20 August 2021",
                "rating": "5.0 out of 5 stars",
                "text": "Genuine apple earpods, great sound quality and amazingly comfortable."
            },
            {
                "title": "Comfortable earphones",
                "date": "Reviewed in the United Kingdom 🇬🇧 on 27 March 2023",
                "rating": "5.0 out of 5 stars",
                "text": "I have reverted back to these Apple earbuds to use with my iPod Nano as they are the most comfortable, and the sound feels full."
            },
            {
                "title": "Suenan Genial, 99% originales",
                "date": "Reviewed in Spain 🇪🇸 on 23 May 2019",
                "rating": "5.0 out of 5 stars",
                "text": "Los que yo tengo originales de la tienda apple ya tienen 2 años, así que los comparo con éstos. Es verdad que no vienen en caja de plástico, muy bonitos para la presentación pero poco útiles para guardarlos, así que puede que apple los haya quitado para ahorrar costes. Sin embargo vienen envueltos en una caja de cartón al más puro estilo apple con todo lujo.Estéticamente y comparándolos centímetro a centímetro son exactamente iguales, los de Amazón el auricular es un blanco mas brillante, pero eso puede ser que los mios estén ya desgastados por el uso y por eso no brillen, pero el tamaño, grosor, estética es exactamente el mismo.Ahora vamos a lo importante, soy un tio gordo, feo, calvo y hace tiempo que no se me levanta pero puedo decir con orgullo que si algo tengo es BUEN OIDO y comparando los 2 auriculares el sonido es exactamente el mismo, puedo garantizar en un 99% que son originales pero a mitad de precio que en las tiendas apple.Si estos me duran 2 años como los otros los volveré a comprar."
            },
            {
                "title": "Betrug",
                "date": "Reviewed in Germany 🇩🇪 on 19 September 2018",
                "rating": "1.0 out of 5 stars",
                "text": "Dies sind NICHT die originalen Kopfhörer. Erkennbar and Soundqualität und Kabelstärke."
            }
        ]
    },
    {
        "name": "Skullcandy Cassette Wireless On-Ear Headphone with Mic (Black)",
        "reviews": [
            {
                "title": "Good for listening loud new age music.",
                "date": "Reviewed in India 🇮🇳 on 26 April 2022",
                "rating": "4.0 out of 5 stars",
                "text": "Sound: low end has great amount of punch. Highs are pretty decent. Mids are a bit boxy. Not suitable for mid oriented songs. Great for edm, hip hop, dubstep. Not very good for rock, metal, acoustic.The sound is very loud.Comfort: ear cushions are really very soft and overall build up is quite flexible. Though it has low durability so be handle carefully. Sadly it hurts the ear if worn for longer duration, like for over half an hour. If comfort is your top priority then it is not upto the mark.Noise cancellation: decent in the segment. Not very effective overall.Bluetooth: never had any issue with connectivity. Connects quickly.Microphone : mic is not very clear. Could be better.Battery life: it is good. You can easily play medium-loud music for 12-15 hours continuous. Full charge in less than hour. Aux is also available if battery goes off.VERDICTpros: heavy bass, loud, rich highs, Bluetooth, aux is also available, battery, looks (subjective).Cons: boxy Mids, low on comfort, bad micBuy if : you like listening to loud music and kick and bass oriented songs like hip hop, edm, New age pop.Don't buy: for gaming, for mixing mastering audio, for listening old songs, rock/metal, acoustic or other Mids oriented songs, or for zoom meetings and phone calls.Edit: been using it for 8 months now. It's still the same. All over a warmer sound. Sound is VERY LOUD. No issue with durability, connectivity, battery. Due to boxy mids and over-all warm nature of the product, sound clarity is compromised a bit. It doesn't have that sizzle in the sound.Good for slow music or heavy bass orientated music. Not very good for details."
            },
            {
                "title": "Good Quality",
                "date": "Reviewed in India 🇮🇳 on 11 March 2023",
                "rating": "3.0 out of 5 stars",
                "text": "Ordered Chill grey model but received Black. Sound on bluetooth mode is good but when connected through aux cable volume is very low and sound quality decreases. Charging cable is too small."
            },
            {
                "title": "⭐⭐⭐⭐",
                "date": "Reviewed in India 🇮🇳 on 30 August 2022",
                "rating": "4.0 out of 5 stars",
                "text": "I brought this bcz it's Skullcandy, it's good but not great, and the build quality is NOT Tough. If u want Brand + just Good sound then go for it, but if the priority is great sound then go to other brand at this price."
            },
            {
                "title": "Nice product",
                "date": "Reviewed in India 🇮🇳 on 20 September 2022",
                "rating": "4.0 out of 5 stars",
                "text": "Nice productAfter a long time get a good quality head phone"
            },
            {
                "title": "Very well sound and bty.becap",
                "date": "Reviewed in India 🇮🇳 on 19 September 2022",
                "rating": "4.0 out of 5 stars",
                "text": "Audio player"
            },
            {
                "title": "Skullcandy delivers everytime",
                "date": "Reviewed in India 🇮🇳 on 25 July 2020",
                "rating": "4.0 out of 5 stars",
                "text": "I haven't tried many headphones to write a review but I'll write what I feel1. Comfort- the cushions are smooth and perfect. You can listen to long hours without any discomfort2. Build quality is good for this price range. These aren't too hard on ear too3. Sound quality is very good. You can expect that from skullcandy. Tones are good. Bass is not very high but enough for a normal listener. If you are a bass lover, then that's some drop for you.4. Sound quality is more better with the aux connected as is the case with all other wireless headphones4. Charging 10 min give upto 1hr 30min of listening time. Good for taking and making callsCons: 1. I think the audio volume is not great. You can't hear it loud enough till you increase it to more than 70%2. No noise cancellation but upto 60% of the noise is impeded by the on ear cushions. You can't expect more noise cancellation at this price.Overall, a great purchase. Highly recommended at this price range. Don't doubt. You can go for it"
            },
            {
                "title": "Good for beginners but not for music lovers",
                "date": "Reviewed in India 🇮🇳 on 6 July 2022",
                "rating": "3.0 out of 5 stars",
                "text": "Cons : A good headphone must have proper balance of all frequencies. I don't why there is so much hype for bass boosted headphones these days. I previously used an Audio Technica headphone. Every frequency was crystal clear there. This product might be a charm for the beginners but not for the music lovers.Pros : 1) Noise reduction is good  2) Pads are soft. It doesn't hurt ears even after long use.  3) Both wire & bluetooth are working fine"
            },
            {
                "title": "Excellent Set of Headphones. Wish it can in all Red.",
                "date": "Reviewed in India 🇮🇳 on 13 October 2021",
                "rating": "5.0 out of 5 stars",
                "text": "This is one of the best ever headphones I have purchased. Amazing sound. Unbelievable battery life. Great looker ( I got the blue one ) Crystal clear sound. Great bass wherever needed. Awesome for watching movies and listening to music. I am in the music industry. So I know my sound. At this price this is an awesome buy. Just handle it with a bit of care. It’s a little delicate. So you might damage it if you throw it around. And pls get a case for it cause it doesn’t come with one in the pack. Don’t think too much if you want to buy a super pair of headphones for a very very decent price. Just go for it. Absolutely recommended."
            },
            {
                "title": "NOT DURABLE AT ALL- made of Weak Material- cracks easily",
                "date": "Reviewed in the United Kingdom 🇬🇧 on 18 October 2022",
                "rating": "2.0 out of 5 stars",
                "text": "It has only been a year and they already need to be replaced because their body is cracking and falling apart.  It doesn't take much to crack the material since it is so brittle and fragile (I don't even use them on the go or abuse them)They look nice and are comfortable enough to wear, but do hurt my ears when worn for a long time. Their battery life is amazing and lasts for a few days on a single charge, depending on use (and volume of sound). I can't say much regarding the sound quality because I am not informed or bothered about it. All I can say is that if it sounded terrible I would know it but these ones sound just fine to me."
            },
            {
                "title": "Cheap and quite good",
                "date": "Reviewed in the United Kingdom 🇬🇧 on 26 January 2022",
                "rating": "4.0 out of 5 stars",
                "text": "First off, battery life: Excellent. Exactly as described. Charged once when they arrived , several days later and they're still charged. The sound is nice, no buzz with bass, everything sounds well balanced. Haven't used them for anything other than listening to music on my android. It pairs easily enough. They are comfortable for prolonged periods of listening. Just be careful whist handling them, they feel like they could be broken eeasily by accident."
            },
            {
                "title": "Buena calidad de sonido y excelte diseño a un muy buen precio",
                "date": "Reviewed in Mexico 🇲🇽 on 6 June 2020",
                "rating": "5.0 out of 5 stars",
                "text": "Los audífonos tienen una excelente calidad de sonido, no preponderan los agudos, como en otros. Los bajos suenan super bien. El diseño está súper cool, además de aislar muy bien el sonido del exterior.Por el precio la verdad vale mucho la pena, si no  quieres gastar mucho en unos audífonos y que estos sean buena calidad, te recomiendo estos. Yo los compré en color morado y es tal cual se muestra en la imagen."
            },
            {
                "title": "MI MEJOR COMPRA DE AUDIFONOS DE ESTE AÑO",
                "date": "Reviewed in Mexico 🇲🇽 on 30 December 2020",
                "rating": "4.0 out of 5 stars",
                "text": "Los compré en el mes de septiembre ya que me sorprendió el precio por lo que ofrecía.Son bastante cómodos, ya que la diadema no aprieta tanto.La batería me duró aproximadamente 20 horas y media (el fabricante promete 22) pero lo que me gustó y el pues de estos audífonos es que son híbridos, si se te acaba la batería puedes ponerle el cable de 3.5mm y podrás seguir escuchando música.En cuanto a la relación calidad precio para mí son los MEJORES audífonos por debajo de 650 pesos mexicanos($32 dólares) que puedes encontrar en el mercado, los bajos son potentes y aunque los graves (escucho más metal y rock) no son taaaan altos realmente se disfruta escuchar musica con estos audífonos, la latencia con su BT 5.0 es estupenda ya que puede llegar hasta 10 metros después de 2 paredes, sin duda alguna son audífonos B, B, B."
            },
            {
                "title": "Great sound quality...",
                "date": "Reviewed in the United Kingdom 🇬🇧 on 26 August 2020",
                "rating": "5.0 out of 5 stars",
                "text": "Skullcandy Cassette Bluetooth Headphones have great sound quality, deep un-distorted bass and crisp treble.  The battery life between charges is great.  They are lightweight and will hopefully be durable.An absolute bargain for less than £30!!!"
            }
        ]
    },
    {
        "name": "JBL Endurance RunBT, Sports in Ear Wireless Bluetooth Earphones with Mic, Sweatproof, Flexsoft eartips, Magnetic Earbuds, Fliphook & TwistLock Technology, Voice Assistant Support (Black)",
        "reviews": [
            {
                "title": "An exceptional set of earphones at dirt cheap price !",
                "date": "Reviewed in India on 20 June 2019",
                "rating": "5.0 out of 5 stars",
                "text": "Ok guys, first thing first- I'm no audiophile (or whatever those music aficionados are called!)So, this review is by a normal guy for normal users.I've added close up photos for reference.The packing: Excellent. Very neatly packed, and very classy. (I had to struggle while opening the inner packet. Couldn't notice the cellotape which was holding it. Stupid me 🙄)The build quality- It's exceptionally well built headset. Everything oozes quality. JBL have really put in their best in this product.Audio quality (that's what matters finally !) : I'm just blown away by the quality of sound! As I said earlier, I'm no audiophile. So, things like highs, lows, mids , treble etc don't make much sense to me. I already own Sony XB450 and Sennheiser 212HD. Both are \"over-the-ear\" wired types. So, they are supposed to be having bigger drivers etc and hence better sound quality. BUT. I actually feel this Endurance run gives them a run for money.. The bass was a little less, yes, but you can always increase bass with your music app settings. I'm typing this right now while listening to \"Teri mitti\" from Kesari. The song has a different level of effect with these earphones! And a major reason behind that is the noise cancellation. Coming on that now.Noise cancellation- I had bought JBL 600 BTNC with active noise cancellation last month. The Noise cancellation was so bad and sound quality so sub-standard that I was forced to return it... But, this set is a different beast! Of course, it has passive noise cancellation. However, even with medium volume, I can't hear anything spoken by my wife (that's of course not good for my health and well being in the long run! Haha). The  noise blocking by this set is phenomenal to say the least. You can barely hear anything from outside unless it's really loud.Comfort: have been listening to music for last 3 hours. No pain in ears at all (ear pain/discomfort is so common with most of earphones). The earplugs don't come out at all. Exceptionally snug fit.Tried Google now. \"Ok Google\" Works like a charm.Very easy to pair, took me barely 5 seconds the first time! Range also seems pretty good, but to be frank, haven't checked from much distance.Buttons on the band are easy to use, and I got used to them within no time. The central button (for play/pause or call) is slightly elevated than the volume buttons on both side of it, so you can touch and feel it. Can't go wrong. Pressing the volume + button for 2 seconds plays the next track (and similar for volume-). Again, intuitive and easy to use.I can go on and on. However, I'm not getting paid for this review. So, need to end this now.😉Just one crib- there should be a way to switch off the blue status LED light, it irritates eyes in the dark (I know, that's a very very minor hassle. However, if I've missed and there really IS some way, do let me know).Thanks for reading (if you had the patience to read till here!). By the way, it's supposed to be splash resistant as well. No, I'm not going to check that.Go, buy it, wear it and go for a run. Regularly. Let's get fitter !  :-)"
            },
            {
                "title": "Battery will not last a day normal use",
                "date": "Reviewed in India on 26 April 2023",
                "rating": "4.0 out of 5 stars",
                "text": "Except this battery everything is normal and as expected nothing fancy. Good and value for money product"
            },
            {
                "title": "Battery",
                "date": "Reviewed in India on 25 April 2023",
                "rating": "4.0 out of 5 stars",
                "text": "Battery performance not good"
            },
            {
                "title": "look good",
                "date": "Reviewed in India on 10 April 2023",
                "rating": "3.0 out of 5 stars",
                "text": "doesn't stay well in ears...can do exercise or Run (impossible) or most sports activities . Its battery weight doent let it stay intact in ear and keep falling out. Dont buy for sports activity...for walking and sitting; Ok to buy. sound is good otherwise and price too is good for the quality."
            },
            {
                "title": "good product",
                "date": "Reviewed in India on 9 April 2023",
                "rating": "4.0 out of 5 stars",
                "text": "good product. battery life is not good."
            },
            {
                "title": "Not worth It!!",
                "date": "Reviewed in India on 12 April 2023",
                "rating": "3.0 out of 5 stars",
                "text": "Doesn't actually help while running, have to keep fitting it.. had to buy another one 😞"
            },
            {
                "title": "Battery is finishing within 4hrs.",
                "date": "Reviewed in India on 31 March 2023",
                "rating": "3.0 out of 5 stars",
                "text": "One, I have bought on 2020. The battery was too good with sound. But now this time, the sound is ok and also battery is discharging with in 3 to 4 hrs."
            },
            {
                "title": "Sound",
                "date": "Reviewed in India on 3 April 2023",
                "rating": "3.0 out of 5 stars",
                "text": "Ranigtha bike cell sound no clear"
            },
            {
                "title": "Produto veio com características de usado e com defeito.",
                "date": "Reviewed in Brazil on 1 July 2020",
                "rating": "1.0 out of 5 stars",
                "text": "O produto chegou, já achei estranho vim totalmente descarregado e com cheiro de perfume forte, apresentando marcas no botão play. coloquei pra carregar, passo mais de 4 horas e continuou apresentando led vermelho, tirei do carregador e tentei conectar o bluetooth, mas nenhum dos aparelhos conecta, não aparece em nenhum. E fica aparecendo sempre o led vermelho. Acredito que o produto está com defeito e esse cheiro de perfume horrível e marcas de uso nos botões  da a entender que esse produto já foi usado.Já abrir o processo de devolução!"
            },
            {
                "title": "Não durou muito",
                "date": "Reviewed in Brazil on 17 June 2020",
                "rating": "2.0 out of 5 stars",
                "text": "De início achei ótimo, atendeu bem às minhas expectativas ao fazer exercícios e tudo mais. Mas não durou muito. Em 3 meses começou a apresentar problema para o conectar o bluetooth e depois de mais umas duas semanas ele não ligava mais. Uma pena!"
            },
            {
                "title": "Qualidade JBL pra quem quer suar",
                "date": "Reviewed in Brazil on 13 January 2020",
                "rating": "5.0 out of 5 stars",
                "text": "O fone surpreende pela boa qualidade de som, algo de se esperar num JBL.Os botões e controles são um pouco grandalhões e desajeitados, mas percebe-se que isso é para proteger o equipamento do suor.Os encaixes para a orelha funcionam em dois modos (encaixe simples, para uso corriqueiro, e encaixe completo, para corrida). No 2o modo ele fica bem firme e dificilmente escapa, mas uso prolongado (mais de 2 horas) começa a incomodar um pouco.A bateria dura MUITO, o que é ótimo.O modo headset (para usar com computador, por exemplo) tem qualidade de áudio bem pior. O ideal é usar mesmo como fone de ouvido."
            },
            {
                "title": "Ottimo prodotto",
                "date": "Reviewed in Italy on 30 June 2022",
                "rating": "5.0 out of 5 stars",
                "text": "Scrivo questa recensione , sperando possa tornare utile a chi sta cercando una ottima cuffia per ascoltare musica e fare sport , nel mio caso Corsa.La faccio principalmente perché sono un appassionato di audio e conoscendo la JBL ero sicuro che acquistando queste cuffie non sarei rimasto deluso , e qui noni spiego le recensioni negative che ho letto....Cuffie arrivate in 1 giorno sempre grazie ad Amazon ma inutile continuare a fare i complimenti a questo colosso perché già sappiamo di cosa stiamo parlando .Le cuffie si presentano in una bellissima scatolina con dentro tutto l'occorrente per caricarle e per adattarle al proprio orecchio.Materiali molto belli al tatto e confortevoli una volta indossate. ( Sembra di non averle)Le parti che ciondolano (comandi) non sono affatto fastidiose , quasi non si sentono per la loro leggerezza.La qualità audio è eccezionale (chi dice il contrario mente) profondità dei bassi voto 9Medi voto 9Alti voto 9Se poi vogliamo confrontarle con cuffie da 300/400 euro sicuramente non sarà la stessa cosa ma se la batteranno alla grande senza fatica.Quindi io affermò che sono cuffie eccezionali, comodissime , e con una qualità audio degna di marchi molto più prestigiosi.Consiglio vivamente l'acquisto sia ai più esigenti audiofili , ai runner che cercano una cuffia idonea e che non cada dalle orecchie , e a chi cerca un auricolare da indossare anche per lavoro.Spero che la mia recensione senza alcun interesse , possa esserci di aiuto.⚡"
            },
            {
                "title": "Aprovado para corrida",
                "date": "Reviewed in Brazil on 1 September 2020",
                "rating": "5.0 out of 5 stars",
                "text": "Utilizei em corridas de 5, 10 e 21Km em ritmo rápido. O fone se ajusta perfeitamente e não cai, nem mesmo com o suor.A qualidade do áudio é ótima e os fones isolam bem os ruídos externos."
            }
        ]
    },
    {
        "name": "Sony MDR-EX155AP in-Ear Wired Headphones with Mic (Light Blue)",
        "reviews": [
            {
                "title": "Good headset",
                "date": "Reviewed in India 🇮🇳 on 7 April 2023",
                "rating": "4.0 out of 5 stars",
                "text": "Though the quality of the sound is better than most other in the market, the mic is not working sometimes while attending the call. I never had issues with previous other headsets"
            },
            {
                "title": "sound and other feature are good, wire ingrdiant lack supreme quality and durability",
                "date": "Reviewed in India 🇮🇳 on 10 April 2023",
                "rating": "4.0 out of 5 stars",
                "text": "sound and other feature are good, wire ingrdiant lack supreme quality and durability"
            },
            {
                "title": "Sony",
                "date": "Reviewed in India 🇮🇳 on 4 April 2023",
                "rating": "4.0 out of 5 stars",
                "text": "Good product I like it 👌🏻😍❤️❤️❤️❤️❤️"
            },
            {
                "title": "Sony headset is awesome ✌️",
                "date": "Reviewed in India 🇮🇳 on 16 March 2023",
                "rating": "4.0 out of 5 stars",
                "text": "This headset bass and sound quality super. audio balance and external noise cancelation well and it's fitting super but wiring quaily low. Overall good parformance."
            },
            {
                "title": "Good product justify amount",
                "date": "Reviewed in India 🇮🇳 on 26 March 2023",
                "rating": "4.0 out of 5 stars",
                "text": "Sound quality is god"
            },
            {
                "title": "Please replace the order as soon as possible",
                "date": "Reviewed in India 🇮🇳 on 3 May 2023",
                "rating": "3.0 out of 5 stars",
                "text": "I did not like the product as it was revoice the callers voice and the delivery boy did not replaced my order"
            },
            {
                "title": "Wire is too small",
                "date": "Reviewed in India 🇮🇳 on 17 April 2023",
                "rating": "3.0 out of 5 stars",
                "text": "Bass preety good but the wire is a bit small in case of pulling out or some accident....it might cut it out easily,in this price range (1000-1300) JBL will be better"
            },
            {
                "title": "Worth every penny",
                "date": "Reviewed in India 🇮🇳 on 8 January 2023",
                "rating": "4.0 out of 5 stars",
                "text": "This is the absolute beast in sound quality, it is just insanely incredible when it comes to the design and sound quality. Talking about sound everything is perfectly balanced highs mids and lows everything is just amazing im a bass lover but this product doesn't disappointed me the bass coming out from this tiny earphones are dope also if you need extra bass you can use equalizer but comparing the overall sound spec bass is just a tiny bit lower. But i strongly recommend this product to bass lovers because you will never get a better one on this price range with all the sound qualities i bet you."
            },
            {
                "title": "Fair",
                "date": "Reviewed in the United States 🇺🇸 on 13 January 2021",
                "rating": "3.0 out of 5 stars",
                "text": "Only good for a few weeks"
            }
        ]
    },
    {
        "name": "(Renewed) Sony WI-C310 Wireless On Ear Headphone with Mic (Blue)",
        "reviews": [
            {
                "title": "Product quality is not good.",
                "date": "Reviewed in India on 19 April 2023",
                "rating": "1.0 out of 5 stars",
                "text": "I had been use before Sony Bluetooth headphones but the quality of sound is quite different I don't know why this happened for the same product and I am not happy with this product."
            },
            {
                "title": "Balanced Sound - Good Built - Great Battery",
                "date": "Reviewed in India on 29 January 2020",
                "rating": "5.0 out of 5 stars",
                "text": "POSITIVES:+ Build: Light Weight to wear. Tanglefree Flat Wires. The wire around the neck is Flexible hence becomes very compact to store.+ Battery Backup: I got 16 Hrs at 60% Volume..!!+ Sound Quality: Might not appeal to a guys for whom the only definition of sound is only BASS. Guys who appreciate a good balanced sound (typically SONY Signature) will love it.C Type Charging Port: The future standard and no need to see which one is the right way to insert into the charging slot.SPECIAL TIP: Even if Medium-sized ear buds might be the right FIT. Try going ONE SIZE UP. It would seal the ear canal better, the BASS KICK improves. The buds are soft enough so comfort remains same.SMALL THOUGHTFUL DETAILS:1. Earbuds inner canals are colored in different colors to easily identify the sizes.2. A small groove is there on the left ear piece to identify the left from right.3. Everytime it powers ON a voice prompt updates the battery % left.4. When the battery is down to 20% the voice prompt gives LOW BATTERY status warning. And even at 20% of battery remaining I managed to get additional 3 Hrs..!!MIC FOR TAKING CALLS: Some of the reviews mention echo while taking calls. I haven't faced any issue whatsoever."
            },
            {
                "title": "Good One",
                "date": "Reviewed in India on 6 April 2022",
                "rating": "4.0 out of 5 stars",
                "text": "Advantages - Good base... awesome quality of sound for music... Call clarity also good ... Disadvantages are... Have to put earbuds while driving bcoz when call incoming no vibration.."
            },
            {
                "title": "Sony is always good. Product was like new.",
                "date": "Reviewed in India on 19 December 2021",
                "rating": "4.0 out of 5 stars",
                "text": "Excellent but I could not understand abount this product and returned. But now think product sound quality was good I could not use in different songs and returned."
            },
            {
                "title": "Sound quality is vary good but please improve battery power",
                "date": "Reviewed in India on 15 March 2022",
                "rating": "4.0 out of 5 stars",
                "text": "Sound quality is very good but improve battery life"
            },
            {
                "title": "Good set of headphones.",
                "date": "Reviewed in India on 3 August 2019",
                "rating": "3.0 out of 5 stars",
                "text": "Quality of headphones is good. Sound quality while playing music is also what you'd expect from Sony. No problem in the build quality, but I began to experience dropped Bluetooth connections when moving to another room in the house, sometimes it would start playing audio from phone speakers even though it was connected, and intermittent audio also once. Got rectified on restarting the headphones. Probably  this was returned due to the above reasons and then sold 'renewed'. I am also returning it and buying a new c200 instead."
            },
            {
                "title": "Seemed like new - and works well",
                "date": "Reviewed in India on 6 July 2020",
                "rating": "5.0 out of 5 stars",
                "text": "I wasn't sure what to expect with renewed but this one was as it was described. The outer box was a little scruffy (as one could have expected) but inside everything was pristine and has been working well since day one. Hopefully that continues.A Sony product you expect to be of top quality and the sound is good, connections are stable and the product has a quality feel to its construction. It sits well and it also looks good.The mic on this does make you hear yourself in the earphones which takes some getting used to but at this price point it would be surprising if it didn't."
            }
        ]
    }
]