[
    {
        "name": "Sony WH-1000XM5 Wireless Industry Leading Active Noise Cancelling Headphones, 8 Mics for Clear Calling, 30Hr Battery, 3 Min Quick Charge = 3 Hours Playback, Multi Point Connectivity, Alexa - Black",
        "reviews": [
            {
                "title": "ALMOST best",
                "date": "Reviewed in India on 11 April 2023",
                "rating": "4.0 out of 5 stars",
                "text": "🔴The ANC (overall great but doesn't block all noise)  It works fine but don't live in a dilemma (I did) that it will block all the noise, I can still hear my ceiling fan on full speed but at a extremely lower volume, my parents talking from few feet aparts is almost non audible but yeah I can hear them at a extremely low volume, the birds chirping from 10-20 feet apart is occassionally hearable too. Play any music while on ANC and then ALMOST every background noise will be blocked.🔴THE CREAKING SOUND WHILE MOVING HEAD in this is almost non noticable, (people say there isn't any creaking noise but there is very minor, it exists)🔴SOUND QUALITY is good BUT the default eq is the worst, you should try different eqs and make yourself one (I thought it would be hard but nope, I was done in 4 minutes) then it will, for me, sounds way better and actually worth paying 26k🔴 It's Comfortable BUT (for someone who doesn't do any sort of neck exercise and have an average head) it's till a bit heavy, I know 250 g for a headphone is very light weight but for me who switched from airpods to headphones, it feels heavy but the comfortable headband always puts me to sleep 😴. The headband is also quite thin, (took me solid 30 minutes to achieve a position where it doesn't hit the top of my head and still feel comfortable.)🔴AMBIENT MODE for an average person is actually great, nothing to complain about🔴Mics are also great, and extreme clear, do check the reviews🟢OVERALLSOUND QUALITY ⭐⭐⭐⭐ANC  ⭐⭐⭐⭐ 1/2⭐Mic  ⭐⭐⭐⭐⭐Highs  ⭐⭐⭐⭐Lows  ⭐⭐⭐⭐⭐Comfort  ⭐⭐⭐⭐🚩🚩🚩Delivery (bought from APPARO RETAIL) ⭐⭐, they literally threw my headphones into a big oversized box WITHOUT ANY PROTECTION, it was just a bix box where my headphones where jumbling, like a small pencil in a big pencil box, no bubble wrap, no paper filling to have my headphones not dance while inside, nothing was given. The headphone box was quite dirty which almost made me return them but the inside (THANKS TO SONY) was well protected."
            },
            {
                "title": "Premium sound with average build",
                "date": "Reviewed in India on 1 May 2023",
                "rating": "4.0 out of 5 stars",
                "text": "My most expensive Sony purchase till date after pendrive walkman and xperia tipo. Always wanted to buy best headphones from Sony after I got job in 2018. But had to wait long to justify the amount i spend with the in hand salary. Finally made my mind to buy this in order to fullfill my long dream.And they didn't disappoint me. Perfect Sony signature sound, balanced bass, perfect ANC. They are my best investment in headphones and going to be untill they stop working.From cons side i find the build quality dull. They don't stand out as premium headphones that senheisser or apple Max does. Also they have strong clamping force, makes me sweaty during an hour of wear in summers.Overall: 8.5/10"
            },
            {
                "title": "XM4 is better value than XM5",
                "date": "Reviewed in India on 1 May 2023",
                "rating": "4.0 out of 5 stars",
                "text": "Case is bulky. Traveling with XM4 is easier than XM5. XM5 is better in quality than XM4  but not by much. Extra price for XM5 is not worth it. Buy XM4 at around 18k. It is very good and value for money. XM5 is definitely excellent but not happy with 27k price tag."
            },
            {
                "title": "Great ANC",
                "date": "Reviewed in India on 4 May 2023",
                "rating": "4.0 out of 5 stars",
                "text": "Sound loudness is low ."
            },
            {
                "title": "Best ANC headphones",
                "date": "Reviewed in India on 18 April 2023",
                "rating": "4.0 out of 5 stars",
                "text": "One of the best ANC headphones..nice sound quality…work as expected no issues…being saying that if you have android device work seamlessly…if you are iPhone user you need to sacrifice few things like spatial audio, hey siri(with voice),reading text messages while headphones are on …what I didn’t like about this is very big headphone case and not sweat resistant…"
            },
            {
                "title": "Excellent headphones",
                "date": "Reviewed in India on 19 April 2023",
                "rating": "5.0 out of 5 stars",
                "text": "I have been using ANC products from different brands for quite some time.Compared to other ANC headphones, Sony has trumped most of them.Obviously they are in a range where Somy had to provide enough features for the people to buy them.Most important feature for me is that I can use the headphones with connection to two devices at the same time. Saves a lot of switching between phone and laptop to attend calls on both of them as and when needed.Noise cancellation works absolutely perfect for me. And the music pauses when I start talking, no need to take off headphones.Must buy when Sony days are announced on Amazon. Costed me 23K with the offers."
            },
            {
                "title": "Amazing Product from Sony",
                "date": "Reviewed in India on 30 April 2023",
                "rating": "5.0 out of 5 stars",
                "text": "I have been using this product from last one month and absolutely have no concern.. The packing and delivery was top notch. The product was genuine and has everything that we are looking from audiophile standpoint... Very light in weight and has good grip on head. Noise cancellation is outstanding. After putting on absolutely no noise. Mics are very adaptive and understand the movement and response rate is really good."
            },
            {
                "title": "Best for taking calls in a noisy environment",
                "date": "Reviewed in India on 14 April 2023",
                "rating": "5.0 out of 5 stars",
                "text": "Been using it for the last two months.Pros:1. Amazing environment noise cancellation for taking calls from noisy environments, without getting your voice masked. It knows what to cancel out, and what not to.2. Comfortable to wear for long durations3. Gets charged in no time, battery lasts for more than a day's usage4. Pretty good ANCCons:1. Sound quality could have been slightly better2. Sometimes it loses connection with my laptop/ phone if I walk to the other room. Bose QC45 does an amazing job in that respect.3. Doesn't fold, cumbersome to carry. But that's ok, you can't ask for the moon at this price point."
            },
            {
                "title": "Best Bluetooth Noise Cancelling Headphones on the Market - Replacing my AirPods Max",
                "date": "Reviewed in Canada on 30 May 2022",
                "rating": "5.0 out of 5 stars",
                "text": "Ready for the best in class noise cancelling headphones with incredible sound profiles completely customizable? I owned them all. AirPods Max, Sony XM3, XM4, Bose 700. The all new Sony XM5’s is the new king of NC headphones.✔ Much Better Microphone (vs. XM4) – Tested with Zoom/Microsoft Teams business calls and family/personal calls. Performs much better than XM4 previous generation✔ Long Term Comfort – I can wear them for long periods of time (several hours) without any discomfort while wearing my glasses. XM4’s felt warm/hot after long term use, XM5’s have more breathability.✔ Touch Controls – Works flawlessly between swipes and tap. Feels like an upgrade with better sensitivity compared to previous generation.✔Bluetooth & Connectivity – I take them off, music pauses, I put them back on, music resumes. I walk anywhere in my home while leaving my phone on my desk. Clear sound, no distortion whatsoever, signal transmission remains in-tact and stable at any given moment. I have them connected to my iPhone and MacBook Pro, I’m able to swap between both devices quickly.✔Hard Case & Wire – The case is good quality, headphones fit perfectly with slot for USB C charging cable and audio aux cable, both included no extra charge.✔Sony app is full of features. Can customize audio profiles or use presets. The presets are excellent for any genres of music and I often swap depending on my mood. Updates are done through the app. NC and transparency mode can be controlled in the app or by using a button on the headphones. Adaptive sound is nice, it auto detects my environment and changes from NC and transparency. It works in my favor, no complaints. Auto power off is an option, or manually turn them off using the button on the headphones.I purchased 2 pairs of the new Sony XM5’s – one for my wife and one for myself. We absolutely love using the latest and greater wireless noise cancelling headphones – I can easily say that both Sony and Apple make the best out there. Because I own all the latest NC headphones, I created a comparison below between the 2 best: Sony XM5’ and how they compare with Apple’s Air Pods Max.Sound Quality: Winner TiedI tested the XM5’s using Tidal and Apple Music using both wired and wireless. I found the music quality on the XM5’s sound better on specific genres such as Jazz, Bossa Nova, Hip-Hop (90’s), Classical Rock, Symphony, and R&B.The APM are ahead when it comes to EDM like House, Drum & Bass, along with Pop and other computerized music.Both headphones are close for most genres, however the biggest difference I noticed between the two was Jazz like genres, with the XM5’s being leagues ahead.This is a tie because it depends on the genre you prefer.Audio Enhancements: Winner Air Pods MaxThe XM5’s offer 360 Audio Reality which is only accessible to less popular streaming music apps like Tidal, while the APM offer Dolby Atmos and Spatial Audio. The audio library for the sound enhancement is also smaller for Sony with limited selections.Comfort: Winner Sony XM5The XM5 can remain on your head for long periods of time (several hours) without any discomfort given its lightweight feel. When walking around the house, or outdoors, the XM5’s remains on your head without moving.The APM on the other hand are heavier and begin causing some discomfort after 1-2 hours. When stationary, they’re fine, but when walking around and tilting your head, they begin to slip off.Features: Winner Sony XM5Sony offers an headphones app accessible from the App Store or Google Play Store which allows you to heavily customize your XM5’s, from building a sound profile, selecting audio pre-sets, adjusting noise cancelling, transparency modes and a great deal more.The APM on the other hand, do not have an app of any kind, besides the ability to select audio pre-sets from the music app you subscribe to.Transparency Mode: Winner Air Pods MaxThe transparency mode on the APM is unlike anything else; I can have full conversations that sound natural. The XM5’s on the other hand are an upgrade from the XM4’s, but it doesn’t sound as natural as the APM.Microphone: Winner Air Pods MaxThe microphone on the APM is excellent; I’ve hosted hundreds of hours of business meetings and personal phone calls; the microphone is crystal clear and professional.The XM5’s on the other hand is an upgrade from the XM4’s and noticeable a lot better, but the APM are noticeably better. I tested the XM5’s for calls and was satisfied with the results.Noise Cancelling: Winner Sony XM5When wearing the APM for a long period of time, my ears feel like they’re going to explode. When I first purchased the APM on the release date, I could use the noise cancelling option for hours however, after over a year, I can no longer handle noise cancellation beyond 15 minutes it gives me severe ear pain and I must switch to transparency mode or take them off and break.The XM5’s on the other hand, do not cause me any pain, regardless of if I’m listening for 30 minutes or 2 hours. During testing, I listened to music for a long period of time and watched a YouTube for an hour.I feel that prolonged listening to the APM using the noise cancelling feature caused my ears to become highly sensitive after using them for over a year, with a feeling of severe cabin pressure. This is also worse if using the Bose QC35’s, with pressure being too intense.I can wear the XM5’s for long periods of time; they manage to block loud televisions and screaming babies. The biggest takeaway is being able to keep them on for several hours without discomfort or pain.Build Quality: Winner Air Pods MaxThe APM are built to look and feel luxurious. From the band, metal, and aluminum components, they feel like the Lamborghini of headphones. The XM5’s on the other hand are made out of sophisticated plastic. Also, the APM has magnetic interchangeable ear cushions that can be purchased separately, while the XM5’s do not.Accessories & Costs: Winner Sony XM5Sony offers a real carrying case that protects the headphones and its accessories from damage/drops. Apple has a bra-like case that doesn’t protect the headphones at all, forcing the user to purchase a third-party case online. Also, Sony offers a headphone cable, while Apple requires a separate purchase ($45). This means between the cable and the case; you’re looking at almost $100 of added expenses with the APM.Moreover, the price at the time of this review is $499 for the XM5’s and $779.00 for the APM. The Sony’s offer a much better value.Conclusion:There are many factors to take into consideration between both brands, but ultimately, my heart is with the XM5’s because they sound better for the genres I listen to (Jazz) on a daily basis, and it puts me in the musical ‘zone’. Also, the noise cancelling feature from the XM5’s don’t give me the ‘cabin pressure’ feeling found from the APM. The price difference between both is also substantial given they are close in most categories."
            },
            {
                "title": "Not worth the money, don't understand the good reviews",
                "date": "Reviewed in Canada on 11 October 2022",
                "rating": "3.0 out of 5 stars",
                "text": "I was fairly disappointed with a few things. The noise cancelling is great for frequencies like those of a fan or jet engine. Absolutely dulls the sounds down and I actually fell asleep with how quiet my surroundings were. For voices? Not the same. Can definitely still hear what everyone is saying and it only dulls them down the slightest bit. Now my main reason for buying these was because I'm going on a plane next week and needed something that was noise cancelling as i have sensory issues but was also looking for a new daily over ear headphone. I'm sure these will have no issues to remove plane jet noise etc. Additionally, the microphones on these are fantastic and people on the other end didn't even know I was wearing the headphones due to how clear they were.Very disappointed with everything else. The sound quality is absolutely horrible compared to other headphones I've listened to. There is ZERO bass even after messing with equalizer settings and turning the bass to \"10+\" it was very flat and neutral. The volume also doesn't get high enough in my opinion; also the higher you turn the volume the less \"full\" sounding the music is if listening to songs, especially if you have custom settings on the equalizer (makes it sound cheap). Never had that issue with others. Coming from Skullcandy crusher evos, i obviously understand these are geared towards being a noise cancelling headphone and not a bass headphone, however I expected more for $500 of my own money.Additionally, these headphones don't fold and come in a larger case than 90% of other headphones out there. Seriously Sony who thought of the no folding design?While they're very light and comfy, have great noise cancelling for certain frequencies, contain amazing call quality, have 30-40 hrs of battery and the touch sensors on the right ear cup are SUPER fun and easy to use, I would not buy these if you're also expecting great sound. Definitely not for people looking for normal to decent bass at the very least.I will say if you're someone who listens to non-bassy music then the audio can actually be super good. But it definitely still doesn't get loud enough. It's also made out of that weird plasticy material that shows fingerprints VERY easily and makes it look like it's dirty. Blah. Will be looking into boses or an alternative instead after my flight"
            },
            {
                "title": "Dissapointed",
                "date": "Reviewed in Canada on 31 May 2022",
                "rating": "2.0 out of 5 stars",
                "text": "Compared to my XM3 and XM4s I don’t notice a huge improvement in noise canceling. Sound quality is certainly different, but I wouldn’t go as far as to say it’s better. Highs and mids feel improved, but the low end feels so flat now.Importantly, the headphones feel EXTREMELY cheap. Also the cushioning on the headband is significantly reduced, so it behinds to dig into the top of my head after about an hour. Ear cups feel great, but the headband is a huge step backwards."
            },
            {
                "title": "A downgrade from the XM4s",
                "date": "Reviewed in Canada on 23 November 2022",
                "rating": "4.0 out of 5 stars",
                "text": "I had the XM4s for the past year and absolutely loved them. Sadly, one of the hinges broke and I can no longer use them properly, so I when I saw that the XM5s were on sale for 100$ less I instantly jumped on them, figuring they would be an upgrade to the previous generation, the XM4.I was not impressed by the sound, I firmly place them within the same quality class as the previous generation.I read that they improved on noise-cancellation and microphone quality. Despite this, it seems to me all Sony did was restyle the aesthetics of the headphones. Regarding how they look and feel when wearing, it's a significant downgrade compared to the XM4s. Neither are they as portable due to fix sides, but the plastic material feels cheap, and the overall design makes them really difficult to wear when doing anything but sitting still, as they often shift or even fall off entirely, which was not a problem whatsoever with the XM4s!Overall, the sound is still great, but this is not what a \"new\" generation of an electronic device should be. Quite disappointed.If you are having trouble deciding between the XM5 and the XM4, I advise to stick with the XM4s."
            }
        ]
    },
    {
        "name": "Skullcandy Hesh ANC Wireless Over-Ear Headphones, Active Noise Cancelling, Wireless Charging 22 Hours Battery Life - Mob White",
        "reviews": [
            {
                "title": "Premium feels 💥",
                "date": "Reviewed in India on 3 May 2023",
                "rating": "5.0 out of 5 stars",
                "text": "From packaging to quality too goodWorth the money but noise cancellation can be betterBut good product worth the purchase 👍"
            },
            {
                "title": "Good one",
                "date": "Reviewed in India on 5 February 2023",
                "rating": "4.0 out of 5 stars",
                "text": "Good one"
            },
            {
                "title": "after using it for an year dropping the review now.",
                "date": "Reviewed in India on 20 October 2022",
                "rating": "3.0 out of 5 stars",
                "text": "The product is just wonderfulbut there is some issue with the Bluetooth connectivity every time I connect it says connected and later after some time it disconnects.I was searching for power reset/hard reset but it not available. checked all the portals but there are lot of users world wide who are facing this issue and i am surprised team skullcandy has no solution for this issue.If we have any alternate option to reset please let me know.Apart from this i have thoroughly enjoyed the product its just fkn crazy.but i cannot say go for itBecause putting lot of money and buying this product and later if heartbroken there is no point.where there are so many brands that come under this category and life is also good. so choose your product accordingly."
            },
            {
                "title": "Most VFM ANC over the ear headphones out there. Period!",
                "date": "Reviewed in India on 14 September 2021",
                "rating": "5.0 out of 5 stars",
                "text": "Physical overview:1. Headphones made out of plastic. Really good build quality. Earcups have soft touch plastic on the outside.2. Earcups have memory foam, which makes them more comfortable to use overtime.3. Headband has sufficient padding as well.4. Outside each earcup, there are two microphones (total 4) that are meant to pickup outside noise and cancel it out by supplying equal amounts of anti noise. The right earcup sports an additional microphone for calls, and does a terrific job in this regard. This microphone array/setup is identical to Sony's flagship over the ear/circumaural ANC headphones, the Sony WH-1000 XM4.5. It sports a built in Tile™ tracker as well.6. It features a collapsible design for enhanced portability.7. The right earcup features the control set as well.8. The headbands extend to a comfortably large size. They extend from the upper joints.Package contents:Headphones, 3.5mm to 3.5mm cable, USB C to USB A charging cable, headphones carrying pouch, user manual and warranty card.Pros:1. Great sound signature, just like the Hesh 3 wireless.2. Very comfortable to use over long periods of time.3. Fantastic ANC at this price. Obviously it's not as dope as Sony WH-1000 XM4 or Bose NC700, but the difference isn't huge, it's noticeable but not huge. Do note that no matter what ANC headphones you buy, at whatever price, it won't block out everything around you, that's the reason why some people set unrealistic expectations with regards to ANC performance, and get disappointed when the product doesn't meet their expectations.4. Battery life is amazing, as claimed by Skullcandy.5. Robust build quality, with collapsible design.Cons:1. No multipoint connection.2. No hard case provided.3. Skullcandy app doesn't support this, so you won't get personal sound on this one.Conclusion:Just go for it if you're looking for high quality ANC headphones at not so high price.P.S.- It's Made in China."
            },
            {
                "title": "It’s not the best but good for the price",
                "date": "Reviewed in India on 24 September 2022",
                "rating": "4.0 out of 5 stars",
                "text": "Battery is not that great with ANC ONOver all good sound"
            },
            {
                "title": "good one to choose",
                "date": "Reviewed in India on 25 June 2022",
                "rating": "4.0 out of 5 stars",
                "text": "i used this product for the class and gaming also its a nice one we can buy it"
            },
            {
                "title": "Comfortable Headphones",
                "date": "Reviewed in India on 28 February 2022",
                "rating": "4.0 out of 5 stars",
                "text": "Its a comfortable light weight pair of headphones.Only drawback is the anc. Feeling too much pressure on ear when anc is on.Better with ambient mode on.And the noise cancellation is not that great , can hear a white noise when it is on."
            },
            {
                "title": "Product looked used , as compare to rates sound is poor",
                "date": "Reviewed in India on 29 August 2022",
                "rating": "3.0 out of 5 stars",
                "text": "Poor sound quality as compare to rates anc is poor to like only 60% anc"
            },
            {
                "title": "Not the best sound, better to get the Crusher Series",
                "date": "Reviewed in Canada on 24 December 2021",
                "rating": "3.0 out of 5 stars",
                "text": "Headphone ReviewI am leaving this same review on several headphones at once as it apples to all of them equally.My husband bought me amazing over the ear headphones recently, but they were corded, and unfortunately even my iPad no longer has a headphone jack.  :-(.  So I bought 5 different headphones on Amazon to find the best one at $200 or less.I am 46 yo, I do not listen to crazy music (think lots of bass, etc).  And so some of the headphones I bought, I was sure I wasn’t going to enjoy at all.  My husband and I both listened to a number of different types of music, as well as movies, to test each.  This is our honest opinion.First I opened the SONLY WHXB910N NOISE CANCELLING headphones.  First of all, WOW, the Noise Cancelling was the best of all the headphones we tried.  Love that these listen to the background and decide for you whether to use the ANC or not.  Sound was good.  They were listed as having boosted bass.  I was a little worried as I am not a fan of a lot of bass, but I didn’t find it intrusive.  However, even on the loudest setting, they just didn’t have as full a sound as the others.  These were my #2 pick of all the headphones we tried.  I almost, almost kept these ones and had packaged up all the rest.  Except for some reason as soon as I decided to keep them, they started playing all my music on 2x speed.  Could not for the life of me get it to stop.  That forced me to move to what was originally my second choice.  But in hindsight, the only reason I loved these more than the ones I kept was that these are SUPER COMFY!  They are not as heavy as the others, and fit fully over the ear.  The others mostly fit over the ear, but tended to press a little more where my earrings were.After this we decided to try all the ANC enabled headphones first.  So next we moved on to the SKULLCANDY CRUSHER ANC.  These were the ones I ended up keeping.  Originally I was worried as they are literally capable of vibrating your head with the bass turned all the way up.  However, there is a slider on the actual headphones, and I was able to turn it down to the range that was perfect for me.  And I even found on the movie soundtrack (Dumbo), I turned it up to really feel Dumbo flying by.  These had the best sound of all the headphones we tried by far.  I originally was going to send them back simply because they were not as comfortable as the Sony ones.  However, I have worn them around for the last 5 hours, and have not found it to actually be noticeable in the least.  I think it was just because I was side by side comparing them at the time.  These are not uncomfortable in any way now that I’ve worn them longer.  These had the 2nd best Noise Cancelling.  I also LOVE the fact that in their app you can do a real hearing test and the app will adjust the headphones specifically for your own hearing abilities.  The sound was even better after I did that.  Finally, the TILE feature is pretty awesome for it you misplace things like this on a regular basis.  (Think messy teenager rooms).Next we tried the SKULLCANDY HESH ANC.  The noise cancellation we didn’t even get around to testing as the sound quality out of the box was simply not the same as the 2 others we tried.  Same Tile feature, which is great.  Felt much lighter in the hands, and not as high quality “feeling”.The items we didn’t even bother opening:  SKULLCANDY CRUSHER EVO.  I have no doubt the sound on these is just as good as the SKULLCANDY CRUSHER ANC, but without the noise cancelling.  Has the same personalized setup for hearing.  I would get those if I didn’t really want ANC.Finally the SKULLCANDY CRUSHER WIRELESS.  Didn’t open.  Bottom end of the line for the crusher series.  Same bass slider.  Since I had already decided on the higher end one we didn’t bother opening and testing this one.Hope this helps!"
            },
            {
                "title": "Headphones cool but...",
                "date": "Reviewed in Canada on 23 November 2021",
                "rating": "3.0 out of 5 stars",
                "text": "Was very excited to receive them but was freakin suprised when I saw how long the included usb-c cord NO AC ADAPTER but what about that 5 inch USB cord?! I mean COME ON.Pairing 2 devices can be a little bit frustrating... Had to turn off and on several time one device until the other connect but hey, 100$ headphones...Sound quality is fine but not that loud enough. The ANC works fine but you get what you paid for.Will wait til they die and might get better one. Will see in a couple of months."
            },
            {
                "title": "Amazing",
                "date": "Reviewed in the United Kingdom on 27 September 2022",
                "rating": "5.0 out of 5 stars",
                "text": "Worth the money amazing sound & noise cancelling is superb"
            },
            {
                "title": "Really good head phones",
                "date": "Reviewed in the United Kingdom on 28 November 2022",
                "rating": "5.0 out of 5 stars",
                "text": "Really good noise canceling headphones and i would recommend seller!"
            },
            {
                "title": "The mic is awful",
                "date": "Reviewed in the United Kingdom on 18 January 2022",
                "rating": "1.0 out of 5 stars",
                "text": "Average to poor noise cancelling. Poor sound leak. Abysmal mic"
            }
        ]
    },
    {
        "name": "Bose Quietcomfort 45 Bluetooth Wireless Over Ear Headphones with Mic Noise Cancelling - Triple Black",
        "reviews": [
            {
                "title": "Excellent product",
                "date": "Reviewed in India 🇮🇳 on 25 March 2023",
                "rating": "4.0 out of 5 stars",
                "text": "Writing a review after almost 9 months of use.1. Noise cancellation is very good. Probably not good enough for India. It cannot stop construction noises from a nearby site but effective for traffic noise. Not good for Mumbai local trains though2. Sound quality is absolutely brilliant. I listen to a lot of Hindustani and Carnatic classical. This is perfect. Have not tried to listen with the 2.5mm jack yet. It should do better with 2.5 mm jack and lossless codec.3. Usually after 8-9 months, in cheaper headphone, the cover of ear pads starts hardening or fraying. For these headphones it feels the same as if they were new.4. Battery life is NOT NOT NOT as good as advertised. I get about 15 hours between recharges."
            },
            {
                "title": "Excellent",
                "date": "Reviewed in India 🇮🇳 on 24 April 2023",
                "rating": "5.0 out of 5 stars",
                "text": "One of the best experience in the headphones world..one of its class with best of the sound with best Noise cancellation features. Bose has made it very simplyin terms of features.. likes volume control button..forward paise backward button and noise cancellation option button..and that's it.. all set to rock..o would say it's a a healthy sound for your ears..price is a bit on the upper side but that what's Bose is all about and acceptable with the quality of sound one can get... thanks"
            },
            {
                "title": "Ratings",
                "date": "Reviewed in India 🇮🇳 on 19 March 2023",
                "rating": "4.0 out of 5 stars",
                "text": "Noise cancellation - 8.8/10Sound quality.  -8.5/10Built quality.  -8.4/10Battery.  -8.9/10Pros- Fast connection, case included. Comfortable upto 3hours.Other than bass all other sounds are better. Vocals are clear and crisp, buy this for instrumental or vocal music listeners,Cons- don't get white or blue, Bose app is very bad. Not very punchy bass , but instead very less... Not recommended for beat based songs obviously."
            },
            {
                "title": "Excellent noise cancelation",
                "date": "Reviewed in India 🇮🇳 on 22 March 2023",
                "rating": "4.0 out of 5 stars",
                "text": "I bought this headphone for my official calls. Very satisfied with its performance, specially noise cancelation. Very comfortable to wear for long hours.One grievance I had was that I got an used and defective product delivered first. That spoiled my enthusiasm a bit but replacement model was good. Although this is more a seller's issue rather than the brands."
            },
            {
                "title": "Noise cancellation is good",
                "date": "Reviewed in India 🇮🇳 on 1 April 2023",
                "rating": "4.0 out of 5 stars",
                "text": "But it feels bit dizzy. Music quality is not very good. It's just ok"
            },
            {
                "title": "Treated myself with the best gift 🎁 this year",
                "date": "Reviewed in India 🇮🇳 on 23 January 2023",
                "rating": "5.0 out of 5 stars",
                "text": "I was looking to buy QC headphones for a long time. Finally took courage to try my hands on QC45 and XM5. Both had offers running and XM5 had more discount over QC45. I went to near by croma store to compare both units.Noise cancellation:Croma had a very big closed indoor space with many people around during festival time, lots of devices playing in the background. Good environment to check the noise cancellation. I liked QC45 among the two. Off/On the NC we can clearly make out the difference.Comfort:Easy, relaxed, no irritation on ears, cups sat nicely over my ears with QC45. Cups are made of synthetic though it didn't make a diff for me.  XM5 are big pushy on the ears and my ears touched the inside sound drivers literally.Ergonomics:You can't go wrong the QC45 cup controls. Works 100% everytime. Thanks to the old gen physical buttons. Otherside xm5 needs time to get used to touch controls. Need trial and error attempts before you master the controls.Sound:QC45 audio quality sounds realistic.  XM5 comes with more punch and amplified base which I felt heavy on my ears.App:Bose app is simple and clear. No nonsense. First time Setup till playback is all guided via app. I have another Sony model XB910N and had experience using their app. They provide 360 audio which is not practical enough. You need to buy those special tracks from other listed apps to experience 360 audio. Sony plays their features to create stickiness for customers. Wat you see on their products is not always yours. You need to keep spending money.Color and looks:It's always subjective. QC45 smoke white color is a gold standard. Vintage piece to own.Marketing strategy:Sony and Bose are quite opposite in marketing strategy. Sony tends to attract young audiences by sharing the tech used in their products like \" 8 array mic setup to get optimal noise cancellation experience\". Even Bose does the same but they won't advertise their intellectual property information in public for any of their products. That differentiates how well the products reach to new age audience.  You will rarely find discounts for Bose products. Sony sales in the last couple of years is heavily into discounts and festive offers.Alternatives:Bose 700 has all the bells and whistles to compete with XM5 for an extra money. But QC45 is classic. End of the day we are buying these headphones for the Audio experience and not for complex smart features on it.I suggest to try the models you like before making purchase decision. Don't go by discounts and brand names.  I also followed the reviews on www.rtings.com before making this choice.Thanks for reading through my purchase experience. Happy shopping and enjoy 🙂👍"
            },
            {
                "title": "Sound, ANC",
                "date": "Reviewed in India 🇮🇳 on 4 April 2023",
                "rating": "4.0 out of 5 stars",
                "text": "Bose"
            },
            {
                "title": "Could be better",
                "date": "Reviewed in India 🇮🇳 on 10 January 2023",
                "rating": "4.0 out of 5 stars",
                "text": "I am reviewing this item after purchasing this item before a month and even after replacement from the service centre.ProsThis headphone is at its best when powered on; Bluetooth connectivity is good. Remember, we can listen to songs without Bluetooth and the software using the cable too.The audio quality is good as long as the source is good.ANC is very good. It blocks most of the sounds (but don't expect the same if anyone shouts at you).The Wake mode is also good for most of the part.Cons1. The device is too bulky2. The power switch is too fragile; so handle with care. (I didn't break it; but the headphone didn't power after 2 weeks).3. Equalizer options are very limited to only 3 bands4. The 3.5 MM cable is very thin; need to have another one for replacement (additional cables are purchasable).5. The packing is not something premium. All the details of the product is on the belt kind of wrap and we may lose such wrappers.6. If you are in southern part of India, the serviceability is not easy. We have to send it to Chennai or Bangalore.ConclusionIf you are a Bose fan, then bear with some discomforts."
            },
            {
                "title": "Sehr gute Noise Cancelling Fähigkeit, schlechte Qualität",
                "date": "Reviewed in Germany 🇩🇪 on 20 September 2022",
                "rating": "3.0 out of 5 stars",
                "text": "Zum Hintergrund: Ich nutze Bose Noise Cancelling Headphones seit vielen Jahren. Meine ultimative Prämisse ist die Geräuschunterdrückung, weil ich die Kopfhörer sehr häufig im Flugzeug trage. Danach kommen - aufgrund der langen Tragedauer - der Tragekomfort und das Packmaß (wie klein kann ich die Kopfhörer zusammenfalten und wie stabil sind sie, wenn sie zusammengefaltet sind) als wichtigste Entscheidungskriterien.Wer also die Kopfhörer eher selten trägt, oder wer die Kopfhörer in eher ruhiger Umgebung trägt, wird mit meiner Beurteilung möglicherweise nicht komplett übereinstimmen.Zur Auswahl des Herstellers: Ich habe immer wieder Noise Cancelling Kopfhörer anderer Hersteller ausprobiert. Fast immer sind diese schon allein deshalb ausgeschieden, weil die Geräuschunterdrückung deutlich schlechter war als bei Bose. Wenn dann doch einmal ein Kopfhörer gut darin war, dann ist er ausgeschieden, weil er unangenehm zu tragen war, oder weil er sich nicht vernünftig falten ließ. Deshalb bin ich immer wieder bei Bose geblieben. Was mich zur Hostorie bringt:Ich habe mit den QC15 angefangen. Ein super Kopfhörer! Lange Zeit auch bei der Lufthansa in der First Class der dort angebotene Kopfhörer für die Gäste. Der Kopfhörer ist nach vielen Jahren immer noch top in Schuss. Von allen bisherigen Kopfhörern aus der Serie ist es der mit Abstand haltbarste. Hier musste ich nie die Ohrpolster tauschen. Er ließ sich auch gut reinigen.Danach kam ich zum QC25. Grund zum Wechseln: Der QC25 funktionierte gar nicht mehr, wenn die Batterie leer war; die Ohrmuscheln waren etwas größer und er lässt sich vor allem kleiner falten. Außerdem fand ich die Farbe damals cool. Den Sound empfinde ich als leicht besser, den Tragekomfort als höher. Dafür ging mit dem QC25 dann aber das elendige Thema des Ohrpolster-Wechselns los. Jedes Jahr muss man zu unverschämt hohen Kosten die Ohrpolster tauschen. Außerdem saugt das Kopfband den Dreck regelrecht auf, sodass der Kopfhörer nach einem Jahr nicht mehr ansehnlich aussah. Das ist auch mein größter Kritikpunkt an Bose: Das Kopfband lässt sich nicht wechseln. Ich habe es mit einem Drittanbieter-Kopfband gelöst, welches halbwegs ordentlich aussieht. Bei einem so teuren Kopfhörer aber ist das ein absolutes No-Go. Das können Beyer Dynamics & Co. wesentlich besser.So kam ich dann zum QC35. Dies ist der Kopfhörer, den ich mit Abstand am häufigsten und intensivsten genutzt habe. Er schlug alle beiden vorherigen Modelle in jeder Hinsicht, wenngleich teilweise auch nur leicht. Das Packmaß und die Abmessungen sind quasi identisch mit dem QC25. Dafür kann der Kopfhörer jetzt drahtlos arbeiten und lässt sich über USB aufladen. Andere Vorteile hingegen sehe ich nicht zwischen QC25 und QC35.Wie aber kam ich dann zum QC45?Nun, mein QC35 brauchte neue Ohrpolster. Auch das Kopfband war nicht mehr schön. Da der Kopfhörer für 229 Euro im Angebot war, habe ich mich auf \"viele Verbesserungen\" für 229 Euro gefreut, anstatt 50 Euro in den alten Kopfhörer zu investieren. Außerdem probiere ich gerne neue Gadgets aus.Der Kopfhörer hat jetzt eine Aware-Mode Taste, mit der man die Umgebung besser verstehen kann, wenn man beispielsweise angesprochen wird.Pro:1. Endlich USB-C. Das war für mich einer der wichtigsten Gründe für die Neuanschaffung.2. Die Aware-Mode Taste ist sehr hilfreich.Contra:1. Es lassen sich beim QC35 zwei Kopfhörer koppeln, sodass man beispielsweise im Flugzeug gemeinsam einen Film zu schauen. Da der QC45 aber eine neue App hat, die wiederum aber den QC35 nicht mehr unterstützt, geht dies nun nicht mehr. Es wäre ein Leichtes für Bose, den QC35 hier zu integrieren. Das ist ein deutliches Minus.2. Bose liefert keinen Flugzeugadapter mehr mit. Bei einem Kopfhörer mit einem UVP von 349 Euro ist das ein Unding. Selbst in den Singapore Airlines Suites braucht man den Adapter noch. Das ist einfach nur unverschämt und zeigt, dass Bose das Verständnis für die Kunden verloren hat.3. Das Kopfband lässt sich nach wie vor nicht wechseln.4. Das Kabel ist zu kurz. Es reicht bei Singapore Airlines beispielsweise nicht in jeder Sitzposition aus. Dadurch reißt man sich das Kabel ständig aus dem Stecker.5. Die Ohrpolster sind weniger bequem als beim QC35.6. Die Tasten für lauter/leiser sind von extremst schlechter Qualität: Die eine hat einen deutlichen Druckpunkt, die andere gar keinen. Es scheint einfach das billigste zu sein, was man einbauen konnte.Meine Schlussfolgerung? Ich werde den QC45 wohl zurück schicken. Sound ist super, aber Verarbeitung ist schlecht, und nicht aus Sicht des Kunden gedacht. Die Nachteile des QC25 und QC35 wurden nicht behoben, sondern es wurden neue Probleme geschaffen (warum zum Teufel braucht der nahezu identische Kopfhörer wieder eine neue App, mit noch dazu weniger Funktionen? Warum ist die Verarbeitungsqualität von Generation zu Generation schlechter? Warum wird - allein schon aus Nachhaltigkeitsgründen - nicht endlich ein auswechselbares Kopfband integriert?).Einziger Vorteil, warum ich den Kopfhörer behalten könnte, ist der USB-C Anschluss. Der QC35 ist das einzige Gerät, für das ich noch ein Micro USB Kabel mitnehmen muss. Das ärgert mich. Aber der Vorteil begründet eigentlich keine Neuanschaffung.Fazit: Die Geräuschunterdrückung ist nach wie vor die beste am Markt, ebenso der Tragekomfort und das Packmaß, insbesondere für Vielflieger, die alles in einen einzigen Bordtrolley packen wollen. Aus Nachhaltigkeitsperspektive (Ohrpolster, Kopfband) enttäuscht Bose aber massiv. Auch der implizite Druck, den QC35 gegen QC45 austauschen zu müssen, damit man wieder gemeinsam hören kann (Stichwort: App-Kompatibilität) ist unangemessen. Wer also einen QC35 hat, oder auch einen QC25 (und wen das Kabel nicht stört), hat aus meiner Sicht keinen Grund zum Wechseln (im Gegenteil)."
            },
            {
                "title": "My top 3 reasons for picking QC45s",
                "date": "Reviewed in the United States 🇺🇸 on 8 November 2022",
                "rating": "5.0 out of 5 stars",
                "text": "I realize the QC45s have some slight shortcomings in certain areas but their strengths are why I chose them. I have watched so many reviews on the top N/C headphones it irritates my wife, but here is what you can learn from my OCD (hopefully). First the competition and why I didn't select these.Airpod Max - Cost, weight and the stupid, stupid, stupid case.Sony XM4/XM5 - Bulky and didn't want gesture controls (just my preference).Bose NC700 - Didn't like the style and band adjustment, didn't fold up small enough and gesture control.There are other headphones in the consumer space but these are the big players and my top 3 reasons for picking QC45s were,1. Space, these fold up into a small case, big, big plus. My main use will be for travel and I wanted the smallest footprint for my carryon.2. Noise cancelling, I tried and compared these to Sony and the NC700 at an electronic shop in an airport and I thought these were the best. This was before the XM5s, from reviews they might have a slight advantage but not significant.3. Comfort, all the reviews said the weight, clamping force, cabin pressure, cavity size and breathability were the best of any of the N/C top picks. Smart move by Bose to have another iteration of the QC35s, the comfort is unrivaled.I will use these mostly for travel, I had QC15s I bought for a wedding anniversary for my wife and I when we were flying for a cruise. They served us well, even bought a Bluetooth adapter for them, still working great and gave them to a family couple. That was 10 years ago, so another anniversary seemed like a reasonable purchase. The other players have features that surpass the QC45s, better sound, more bass, more adjustments but none of these were that important to me. For me comfort was very high on the list and I just like physical buttons and the sound is very good so no complaints there.UpdateComfort - After almost 1 month I can confirm the comfort of these headphones. My wife's sleep schedule is different than mine so I have been using these connected to our Apple TV while she is sleeping. 2 or more hours with no fatigue, pain or any discomfort at all. As I stated in my original review, comfort was probably my top priority and I am so happy with them.Noise Cancelling - I give the noise cancelling 5 out of 5, absolutely amazing and no hissing or cabin pressure. Adjustable NC just isn't that important to me, I just want it on or off. In this case it would be ambient, it would be nice to have the option to just turn NC off. Hoping a firmware will be coming to give that option but not a big deal.Sound - EQ'd the sound in the app and I am very happy with how they sound. I'm not a bass junkie or a audiophile but I like upper scale speakers (2 Sonos 5s in my living room for example) and these headphones do not disappoint.Battery - I haven't measured the actual time but the claimed 24 hours seems pretty close and that is more than adequate.2nd UpdateMy adult daughter flew home for Christmas and she had replaced her Bose QC 25s that had stopped working with the Sony XM4s. So I got to spend some time with the XM4s, played with the app, listened to music, tried the noise cancelling and wore them for a while to test the comfort. I was very impressed, not surprising given the reputation of the XM4s but my personal opinion is the sound was very comparable to my Bose QC45s. I didn’t A/B switch the headphones but I have been listening to the QC45s for a couple of months now so that gave a good reference point. Noise cancelling of the XM4s was excellent, I still think the Bose have the edge but only a very slight advantage, it was cool to have the ability to turn off NC and get better battery life and still wish the Bose had this feature (still holding out hope a firmware will come to give this) but it isn’t a big disappointment for me. The comfort was again excellent, the ear cushions were super supple and gave a great seal. The Sony app had a lot more options than the Bose, if your an app nerd you could geek out on it, if your not it could seem complicated, for me I wouldn’t spend time in it so it’s not a significant advantage but that’s me. As I said in my original review adjustable NC isn’t something I would use so that feature isn’t for me but the Sony’s have it if you would like it.Summary of the XM4s from my perspective is they are comparable to the Bose in many ways, comfort, sound, noise cancelling, case size and better in some aspects like the app and the ability to turn NC off. It comes down to personal preferences and I like physical buttons but wow if you like the features of the Sony they are a top of the line headphones and you would love them. I still would choose the Bose but it was fun playing with the Sony XM4s.3rd UpdateThere were some references to wind noise with the QC45s in comments and reviews because the 45s don't have the ability to turn off NC (if I remember correctly). I was letting the dog out the other day and had my QC45s on and there was a mild wind. Yes you do get wind noise, so if you are going to use headphones outside consider this. I don't see this being an issue for me, guess only when I let the dog out, yeah first world problem. I keep mentioning the firmware update that could fix this (and added battery when not needed) with some hopes that a Bose rep will take notice (might have a better chance of winning the lottery) but for now this is a narrow circumstantial issue. For me it's the comfort that trumps the advantages that the competition has over the QC45s."
            },
            {
                "title": "Perfect...for my needs",
                "date": "Reviewed in the United Kingdom 🇬🇧 on 8 July 2022",
                "rating": "5.0 out of 5 stars",
                "text": "I had an older pair of Bose QC15s that I gifted on, and was looking for a new wireless replacement.  I looked at the usual suspects in this arena - the SONY XM range, the Apple AirPod Max, and of course the Bose QC/NC range.  I immediately discounted the SONY XM5 and Bose NC700 purely on the fact that they don't fold, nor do I care much for the looks.  The touch controls put me off as well.To be clear, I'm no audiophile.  In priority order, for me its:- Comfort- ANC- Audio qualityI don't like loads of bass that shakes my head, preferring a clean, balanced sound, and don't really care for having countless configuration options in an app either.  Nor do I use my headphones that much around the house, their primary purchase being to reduce the constant drone when traveling on planes and trains.  Beyond that they are there for when I need them.If you read up too much, like I did, you end up with a big list of reasons to support the purchase of any of those headphones I listed.  You'll read good on all, and you'll read bad on all, although I will say that for most people, the XM4s are going to be a great buy for most people, being relatively cheap, USB-C, with variable ANC, and a good EQ.  I tried them - just not for me.  Too much bass, which sounded terrible when tuned out, not as comfy as my QC15s, and far too dependent on the companion app.These QC45s are, without doubt, the most comfortable pair of headphones I've ever owned.  They sit perfectly over my ears and don't touch them anywhere.  They are light, foldable, and you almost forget you are wearing them.  That's the first requirement ticked.The ANC is significantly better in comparison to my QC15s, especially at reducing the higher frequencies.  Given that I was happy with the QC15s in that regard, this was an easy tick in the box.  Others may be \"better\", but I simply don't care about all the different aware modes or variable this and that.  Just want to switch them on, drown out the outside world as much as possible, and immerse myself in the music or whatever it is I'm listening to.At this price point, you are not going to get a \"bad\" sounding pair of headphones.  Any differences and nuances are down to personal preference.  Some like a load of bass, some like a more neutral sound, some want absolutely perfect studio reproduction.  For me, these fall somewhere in the middle.  I will agree, without the recent firmware update that added the EQ, the QC45s did sound a little light on bass and heavy on treble.  However, that's now fixed, so with a couple of notches up on the bass and a couple down on the treble, the sound is, for me, perfectly adequate to my ears.  The bass is punchy enough to hear it without it shaking your head and causing fatigue.People can hate on Bose all they like, just as people will hate on Apple.  At the end of the day I buy products based on my needs, and these just live up to their name - QuietComfort.  Sure, trying headphones side-by-side it's easy to pick out differences, but in isolation, these are objectively a very good pair of wireless active noise cancelling headphones that, for me, do everything promised of them.As for battery life...given that I come from needing to use a AAA battery in my old headphones, 25 hours between charges is a huge amount of time.  Yep, others last longer, but I'm sorry, if 25 hours isn't enough, you've got much bigger problems in life than this first world issue!"
            },
            {
                "title": "Krasser Rückschritt",
                "date": "Reviewed in Germany 🇩🇪 on 27 October 2021",
                "rating": "2.0 out of 5 stars",
                "text": "Als absolut begeisterter Nutzer der QC 35 II hatte ich den QC 45 bestellt bevor er verfügbar war. Heute ging er zurück.PRO:- Noise cancelling gefühlt noch eine Ecke besser als beim QC 35 II- Klang gefühlt noch ein bissl ausgewogener und runder- bekannt guter Sitz- Sie haben die Tasten nicht angefasst (die touch-Oberfläche des Bose 700 finde ich abartig, den hatte ich auch probiert)NEUTRAL:- Der Transparent-Modus soll ja toll sein, nur wer braucht den wenn man den Kopfhörer mal eben schnell vom Ohr nehmen kann? Ist ja kein Earbud, denn man dann dumm in der Hand hält ... . Ich verstehe das nicht, aber gut.CON (tja ...):- Kein abgestuftes Noise Cancelling mehr (\"Wind-Modus\"!?!)- Vor- und Zurückspulen auch weg (2x bzw. 3x Klick-UND-HALTEN auf den mittleren Knopf)- Neue Management-App die offenbar ein Konto braucht- Kein Equalizer? (hier kann ich mich täuschen)Auf letzteres könnte ich noch verzichten, obwohl ich das doch recht häufig mal nutze. Der Wind-Modus ist leider FÜR MICH ein absoluter Deal-Breaker habe ich feststellen müssen. Ich nutze den QC 35 sehr oft draußen, da ist der QC 45 leider einfach ... kein Vergleich.Ich verstehe das nicht. Das Produkt war tatsächlich ansatzweise perfekt, und jetzt ist es ... defekt."
            },
            {
                "title": "Nicht ganz so High-End wie der Preis",
                "date": "Reviewed in Germany 🇩🇪 on 2 October 2021",
                "rating": "3.0 out of 5 stars",
                "text": "Ich habe mir vor ein paar Wochen die Sony XM3 gekauft und diese jetzt mit den aktuellen Bose QC45 verglichen. Zunächst Mal zwischen den QC45 und den XM3 liegt eine Preisdifferenz von 150 Euro!Folgende Punkte sprechen aus meiner Sicht für die QC45:- Sie sind bequemer und leichter- Mir gefallen die Kopfhörer optisch etwas besser- Analoge Steuerung gefällt mir besserAllerdings gibt es folgende negative Aspekte:- Das ANC gibt ein hörbares Grundrauschen von sich. Das ist beim XM3 deutlich angenehmer und weniger hörbar.- Der Klang fühlt sich etwas flach an. Allerdings habe ich den XM3 auch nach meinen Vorlieben über den EQ angepasst. Diese Möglichkeit fehlt leider auch beim QC45.Insgesamt muss ich sagen, dass mir das Gesamtpaket beim XM3 besser gefällt und ich nicht einsehe 150 Euro mehr für die Bose QC45 zu zahlen."
            }
        ]
    },
    {
        "name": "PLUSPOINT Kids Headphone with Different Themes | Funny Cute Cartoon Models for Boys with Wire | high Sound Quality | No harm to Kids Ears",
        "reviews": []
    },
    {
        "name": "EDYELL C9 Wireless Earbuds/Bluetooth Earphones with ENC Noise Cancellation with 4-Mic Clear Call, in-Ear Headphones, 13mm Powerful Bass Drivers, 48+ Hours of Playtime, Bluetooth 5.3, High Audio Quality, Low Latency, IPX7 Waterproof",
        "reviews": [
            {
                "title": "Best sounds and battery back up",
                "date": "Reviewed in India on 26 April 2023",
                "rating": "4.0 out of 5 stars",
                "text": "I am using this product since 10 days and one thing i must say that it is the best earbuds  in this price range . Sound quality is good , connectivity is super fast and one of the best thing is that once you charge it fully , you can use it till many days even if you use it many hours a day...I never saw such strong battery back up in any of earbuds till now …. Go for it without any doubt"
            },
            {
                "title": "Falling out",
                "date": "Reviewed in India on 1 May 2023",
                "rating": "4.0 out of 5 stars",
                "text": "Sound is good.. Bt it doesn't fitted into ears. It's falling whenever you bend or move too much."
            },
            {
                "title": "Sound quality",
                "date": "Reviewed in India on 18 April 2023",
                "rating": "4.0 out of 5 stars",
                "text": "Sound quality is nice without any problem"
            },
            {
                "title": "Best earbuds",
                "date": "Reviewed in India on 20 April 2023",
                "rating": "4.0 out of 5 stars",
                "text": "Sound quality is nice.Comfortable in ears.Touch control is the best."
            },
            {
                "title": "Value for money",
                "date": "Reviewed in India on 20 April 2023",
                "rating": "4.0 out of 5 stars",
                "text": "Calls, Music, bass, voice , Enc all are good. Decent battery backup. Overall good product and value for money. You can buy without hesitation."
            },
            {
                "title": "Good quality sounds and battery",
                "date": "Reviewed in India on 4 May 2023",
                "rating": "5.0 out of 5 stars",
                "text": "Sound quality is pretty good and seems battery would be running more than 12 days with 3 to 4 hours daily use.Features are awesome like increasing volume, one tap call receive and the best part both left and right pods can be connected with different different devices"
            },
            {
                "title": "V good sound quality",
                "date": "Reviewed in India on 5 May 2023",
                "rating": "5.0 out of 5 stars",
                "text": "Calls, Music, bass, voice , Enc all are good. Decent battery backup. Overall good product and value for money. You can buy without hesitation."
            },
            {
                "title": "Good",
                "date": "Reviewed in India on 5 May 2023",
                "rating": "5.0 out of 5 stars",
                "text": "A very good product at this priceA good sound quality and a good build quality. A recommended this product 😍"
            }
        ]
    }
]