[
    {
        "name": "Samsung Ehs64 Ehs64Avfwecinu Hands-Free Wired In Ear Earphones With Mic With Remote Note (White)",
        "reviews": [
            {
                "title": "Samsung ehs64 earphones",
                "date": "Reviewed in India 🇮🇳 on 27 April 2023",
                "rating": "4.0 out of 5 stars",
                "text": "Definitely they will work for 1.5 year's"
            },
            {
                "title": "Sturdy build, Decent price",
                "date": "Reviewed in India 🇮🇳 on 23 March 2023",
                "rating": "4.0 out of 5 stars",
                "text": "Buying for the third time for my parents phone(purchased from physical store for 500/- each time and now online). These have averaged over 1.5 years with over 6-7 hours of everyday use and it is truly rough and tough / careless usage (pulling on the wire, swinging ear buds hitting floor and bouncing back at times kinda use.) Decent build quality and good sound, mic quality with good warranty support makes it a decent and worthy purchase. Not for audiophiles though. This is the default \"that'll do\" product from a trusted brand.EDIT : Received Feb 2023 make product. Thickness of wire have reduced overtime but this is the first time I am purchasing this online. Everything else feels ok. I really hope it's the genuine product."
            },
            {
                "title": "Ok",
                "date": "Reviewed in India 🇮🇳 on 18 April 2023",
                "rating": "4.0 out of 5 stars",
                "text": "Value for money"
            },
            {
                "title": "Good",
                "date": "Reviewed in India 🇮🇳 on 15 April 2023",
                "rating": "4.0 out of 5 stars",
                "text": "Good"
            },
            {
                "title": "Nice audio quality",
                "date": "Reviewed in India 🇮🇳 on 10 April 2023",
                "rating": "4.0 out of 5 stars",
                "text": "Best quality product."
            },
            {
                "title": "Samsung Wired earphone",
                "date": "Reviewed in India 🇮🇳 on 5 April 2023",
                "rating": "4.0 out of 5 stars",
                "text": "Samsung wire earphone sound quality no one can beat"
            },
            {
                "title": "Nice headphone",
                "date": "Reviewed in India 🇮🇳 on 30 March 2023",
                "rating": "4.0 out of 5 stars",
                "text": "Sound quality is good in this price range"
            },
            {
                "title": "Good quality",
                "date": "Reviewed in India 🇮🇳 on 28 March 2023",
                "rating": "4.0 out of 5 stars",
                "text": "Good quality"
            }
        ]
    },
    {
        "name": "Apple EarPods with Lightning Connector",
        "reviews": [
            {
                "title": "Nothing to tell always Apple is the best",
                "date": "Reviewed in India 🇮🇳 on 4 April 2023",
                "rating": "4.0 out of 5 stars",
                "text": "Like"
            },
            {
                "title": "Good sound but",
                "date": "Reviewed in India 🇮🇳 on 17 March 2023",
                "rating": "4.0 out of 5 stars",
                "text": "Sound is very good but the wire is very thin I think it break very easy"
            },
            {
                "title": "Nice product",
                "date": "Reviewed in India 🇮🇳 on 25 March 2023",
                "rating": "4.0 out of 5 stars",
                "text": "Nice"
            },
            {
                "title": "Really Good Product",
                "date": "Reviewed in India 🇮🇳 on 2 May 2023",
                "rating": "5.0 out of 5 stars",
                "text": "Apple is really caring about their customers."
            },
            {
                "title": "Best in this range",
                "date": "Reviewed in India 🇮🇳 on 10 April 2023",
                "rating": "5.0 out of 5 stars",
                "text": "This is best product in this price range and  I bought this for calling purpose and i think this is best product in this price range and this is much better than any neckband in this price range even this can beat higher value earphones or earbuds."
            },
            {
                "title": "Genuine Apple Product",
                "date": "Reviewed in India 🇮🇳 on 16 April 2023",
                "rating": "5.0 out of 5 stars",
                "text": "Sound quality is really good. Mic is also great. Good value for money. Genuine Apple product. Works really well with my iPhone 14. Overall satisfied."
            },
            {
                "title": "Genuine product.",
                "date": "Reviewed in India 🇮🇳 on 21 April 2023",
                "rating": "5.0 out of 5 stars",
                "text": "Works perfectly well. This is a genuine product. Sound quality is just amazing & love the bass. Love it."
            }
        ]
    },
    {
        "name": "boAt Bassheads 242 in Ear Wired Earphones with Mic(Active Black)",
        "reviews": [
            {
                "title": "Boat Earphones Are Awesome",
                "date": "Reviewed in India on 5 May 2023",
                "rating": "4.0 out of 5 stars",
                "text": "I am obsessed with boat products because it is easy to use and handy as well as comfortable which makes me everytime happy.#BoatAhead#Go Boat#Beautiful Design🔥🔥🔥"
            },
            {
                "title": "Really good product for its price",
                "date": "Reviewed in India on 30 April 2023",
                "rating": "4.0 out of 5 stars",
                "text": "At this price point this earphone is probably best in the market if you can get it under 500 during sales it should be an instant buy if you're looking for earphones."
            },
            {
                "title": "Boat 242",
                "date": "Reviewed in India on 30 April 2023",
                "rating": "4.0 out of 5 stars",
                "text": "Heyy,I was searching for a overall best earphone under 500 but I didn't found any then I prefer this at 600...If you want a overall best earphone then go for it"
            },
            {
                "title": "Good one but eska ear k pass toot gaya",
                "date": "Reviewed in India on 5 May 2023",
                "rating": "4.0 out of 5 stars",
                "text": "Build quality thodi aur achi kro boat team everyhing is superb only ear k pass ki plastic breakable thi.. Baki I'm happy with performance."
            },
            {
                "title": "Excellent sound quality",
                "date": "Reviewed in India on 3 May 2023",
                "rating": "4.0 out of 5 stars",
                "text": "Sound quality is good but a bit over priced though"
            },
            {
                "title": "Best in this segment",
                "date": "Reviewed in India on 5 May 2023",
                "rating": "4.0 out of 5 stars",
                "text": "Bass 4/5Quality 4/5Sound 4/5"
            },
            {
                "title": "Nice",
                "date": "Reviewed in India on 4 May 2023",
                "rating": "4.0 out of 5 stars",
                "text": "Nice earphones"
            },
            {
                "title": "Nice product",
                "date": "Reviewed in India on 2 May 2023",
                "rating": "4.0 out of 5 stars",
                "text": "Good"
            }
        ]
    },
    {
        "name": "iClever Kids Wired Headphones for Boys, Headphones for Kids, Over Ear Headphones with Mic Safe Volume Limited Adjustable Headband Foldable Kids Headset for Online Class/iPad/Tablet, Blue",
        "reviews": [
            {
                "title": "Great headphone",
                "date": "Reviewed in India 🇮🇳 on 10 March 2023",
                "rating": "5.0 out of 5 stars",
                "text": "Awesome product. Great quality"
            },
            {
                "title": "Gud for kids",
                "date": "Reviewed in India 🇮🇳 on 1 April 2023",
                "rating": "3.0 out of 5 stars",
                "text": "Quality is not dat gud but it's ok"
            },
            {
                "title": "No Service centre detail in India or replacement provided by Amazon .",
                "date": "Reviewed in India 🇮🇳 on 23 February 2023",
                "rating": "1.0 out of 5 stars",
                "text": "On side ear head phone not Audible. No service center in India. No detail provided in website or Amazon site.No replacement provided Amazon . False warranty term mentioned in Amazon site. They should mention no warranty or Guarantee in Amazon site since no service support provided by vendor or OEM. Amazon and vendor  Miss guiding and selling the product in Amazon site. This is cheating."
            },
            {
                "title": "Refund issue",
                "date": "Reviewed in India 🇮🇳 on 9 March 2023",
                "rating": "1.0 out of 5 stars",
                "text": "Don't buy this product"
            },
            {
                "title": "Not worth buying",
                "date": "Reviewed in India 🇮🇳 on 3 December 2022",
                "rating": "1.0 out of 5 stars",
                "text": "Stopped working in 3 months. Useless, a waste of money."
            },
            {
                "title": "Good for students",
                "date": "Reviewed in India 🇮🇳 on 8 June 2022",
                "rating": "5.0 out of 5 stars",
                "text": "No hard sound"
            },
            {
                "title": "Ok",
                "date": "Reviewed in India 🇮🇳 on 4 March 2023",
                "rating": "5.0 out of 5 stars",
                "text": "Ok good"
            },
            {
                "title": "BEWARE! Not all colours have mics.",
                "date": "Reviewed in Canada 🇨🇦 on 27 August 2020",
                "rating": "1.0 out of 5 stars",
                "text": "I bought these headphones for my youngest two kids because I wanted them to have a mic in case they had to go back to online schooling. We received them a couple days ago the blue ones have no mic. They have the same part # and are part of the same item in Amazon. When shopping I looked at the pink ones first, which have a mic and then added the blue ones for my son. While I see now that the blue ones have a different description it never occurred to me that they would have different options as they're the same listing and have the same part #. The headphones themselves are nice and the quality seems fine (time will tell) but super frustrating."
            },
            {
                "title": "Bought multiple and they broke after 4-6 months. The service was outstanding however",
                "date": "Reviewed in Canada 🇨🇦 on 10 April 2021",
                "rating": "3.0 out of 5 stars",
                "text": "I bought this model for my 3 kids, then one of them stop working after a few months. I suspected that my kid may have been the issue, or they dropped it, so I bought a replacement. I can say that within 6 months they all failed and suffer from the same issue. The connection to the headset breaks after a while, regardless of their usage. I can't stress this enough, those headphone were not abused or misused. They all start failing about the same time. At first one of the ear isnt working, then a few weeks later it both stops.At 30ish $ and branded for kids, I expected a lot more. I can't understand how this product got a 9000+ positive review, in my experience this was a waste of money.Updated ———I got an email about my unfortunate experience and got a chance to evaluate this product once again. I must say that I am truly impressed by this gesture as they have replaced all my faulty headphones with new ones. So far so good, i will update this again after a few months and see if the units still works."
            },
            {
                "title": "Great Product & Excellent Customer Service",
                "date": "Reviewed in Canada 🇨🇦 on 30 August 2020",
                "rating": "5.0 out of 5 stars",
                "text": "Update - We bought these for our daughter and she loves them comfort wise. She is six and they fit her perfectly and comfortably. She will wear them on longer drives when she would not wear others. I like the volume controlled for little ears. Our first pair had a problem of static around the cord connection which is a common headphone problem which I thought might be mitigated by the soft cord. When I contacted customer service about it, they responded immediately and sent out a new pair so quickly that we were a little surprised. Great communication, great service, and we are back to having the comfy headphones we wanted. Thanks so much!"
            },
            {
                "title": "stopped working within a month but I was refunded",
                "date": "Reviewed in Canada 🇨🇦 on 18 July 2020",
                "rating": "5.0 out of 5 stars",
                "text": "My daughter loved these headphones - they fit perfectly and she really enjoyed that they were made for her but they stopped working within a month of purchase and there was no way other than leaving a bad review to contact the seller. They did offer to replace the item but it took enough time that I had already replaced it with another brand - which my daughter doesn't love quite as much. My daughter was really disappointed when it stopped working.  I must have just gotten a dud product as the seller stands by their product and will refund or replace if it doesn't work."
            },
            {
                "title": "Product Update: Volume Button Doesn't Work",
                "date": "Reviewed in Canada 🇨🇦 on 15 November 2022",
                "rating": "5.0 out of 5 stars",
                "text": "The headphones are soft and comfortable. The fit is good however the volume button doesn't work. Sound is adequate even with the faulty button.Update: The company reached out to me and offered to send another headset. Now that's great customer service. They arrived within days and work great.Thank you so much!"
            }
        ]
    },
    {
        "name": "(Renewed) Sony Wh-Ch510 Bluetooth Wireless On Ear Headphones With Mic (Blue)",
        "reviews": [
            {
                "title": "Amazing sound quality",
                "date": "Reviewed in India 🇮🇳 on 29 April 2023",
                "rating": "4.0 out of 5 stars",
                "text": "Product are very awesome.  ButDelivered time are very slowSo ireteted something"
            },
            {
                "title": "The ear piece is small and makes uncomfortable after 45 mins of use",
                "date": "Reviewed in India 🇮🇳 on 4 March 2023",
                "rating": "4.0 out of 5 stars",
                "text": "Read reviews title, thats it"
            },
            {
                "title": "Quality",
                "date": "Reviewed in India 🇮🇳 on 19 February 2023",
                "rating": "4.0 out of 5 stars",
                "text": "Super 👌 sound and long battery life"
            },
            {
                "title": "Sony headphone",
                "date": "Reviewed in India 🇮🇳 on 21 February 2023",
                "rating": "4.0 out of 5 stars",
                "text": "Good"
            },
            {
                "title": "Ok simply good",
                "date": "Reviewed in India 🇮🇳 on 11 February 2023",
                "rating": "4.0 out of 5 stars",
                "text": "Buttons very herd"
            },
            {
                "title": "Just go for it",
                "date": "Reviewed in India 🇮🇳 on 14 March 2023",
                "rating": "5.0 out of 5 stars",
                "text": "I was worried that it wouldn't work well but it looks new packed in it's original package and had the best sound quality ever and that too at half of its price"
            },
            {
                "title": "Best under 2000/-",
                "date": "Reviewed in India 🇮🇳 on 27 June 2022",
                "rating": "4.0 out of 5 stars",
                "text": "Pros  ------Amazing battery life lasts easily a week on heavy usage, it's been a month since I purchased these headphones I just charged them 2 times, not particularly for gaming but u can play games just fine. Connects with pc with no latency in valorant, but noticed latency in pubg. (Latency is not an issue with a iPhone,but Androids 🥲)  and very comfortable also used them in train for 3.5 hours.Cons -------- full charging time is too much 4.5 hours ( not an issue with me overnight charging 👌)Your own voice repeats on 🤙 call ( it's a feature  by Sony and I like it )It's sometimes  disconnects and reconnects for a split second (rarely)Range ------ it's not that great 10-20 metres also depends on the location.Conclusion ---- for 1800/- they are bang for the buck"
            },
            {
                "title": "Same as original one",
                "date": "Reviewed in India 🇮🇳 on 22 February 2023",
                "rating": "5.0 out of 5 stars",
                "text": "I am so happy to get this profit at very cheap price. Sounds really awesome but voice eco is there.. anyway best deal for me"
            }
        ]
    }
]