[{"name":"OSFT 2 Pcs Disassembly Heavy Duty Suction Cup Opening Removal Tool,Suction Dent Puller for LCD Screen Repair of Laptops Tablets Phones(Black)","imgUrl":"https://m.media-amazon.com/images/I/31jJzKWpG0L._SY300_SX300_QL70_ML2_.jpg","reviews":[],"_id":"6458d7e5e046597d8732b80f"},{"name":"Amcrest 1080P Webcam with Microphone & Privacy Cover, Web Cam USB Camera, Computer HD Streaming Webcam for PC Desktop & Laptop w/Mic, Wide Angle Lens & Large Sensor for Superior Low Light (AWC195-B)","imgUrl":"https://m.media-amazon.com/images/I/41DVwgBBoGL._SX300_SY300_QL70_ML2_.jpg","reviews":[{"title":"Happy","date":"Reviewed in India 🇮🇳 on 30 July 2021","rating":"5.0 out of 5 stars","text":"It was difficult to purchase since there were no reviews so went only with the specs, but I am very happy with the cam."}],"_id":"6458d7ebe046597d8732b810"},{"name":"OSFT 10 Pcs Disassembly Heavy Duty Suction Cup Opening Removal Tool,Suction Dent Puller for LCD Screen Repair of Laptops Tablets Phones(Black)","imgUrl":"https://m.media-amazon.com/images/I/31jJzKWpG0L._SY300_SX300_QL70_ML2_.jpg","reviews":[],"_id":"6458d7f2e046597d8732b811"},{"name":"Lenovo IdeaCentre Gaming 5 Desktop (AMD Ryzen 5 5600G/16GB/512GB SSD/Windows 11/NVIDIA GeForce RTX 3060 12GB GDDR6/WiFi 5/Bluetooth 5.0/Raven Black), 90RW00GCIN","imgUrl":"https://m.media-amazon.com/images/I/21eKxlbn2qL._SX300_SY300_QL70_ML2_.jpg","reviews":[{"title":"Okiesh product don't expect much","date":"Reviewed in India on 24 March 2023","rating":"3.0 out of 5 stars","text":"It says ram upgradable upto 32 Gb but only has 2 slots with 8gb ram. For upgrading you will have to throw away either one or both pre-installed ram. You have to pay Lenovo technician to upgrade and also purchase parts from them only else warranty will be void. That's what Lenovo support guy told me. Lenovo support makes all efforts to by pass calls telling network issue. Many ports not working but some are. Pre-installed macafee slows down system and uses to much CPU and Ram. If you can assemble similar specs even at little higher price then go for that."},{"title":"GO FOR IT!!!","date":"Reviewed in India on 17 January 2023","rating":"5.0 out of 5 stars","text":"I've been using this over a month and seriously i am really satisfied with my purchase. The only issue you will face is the storage which you can put 3k-4k to buy a good hdd for storage. The space for the intake should have been given more but what will you expect when you buying it for cheap, this problem can be solved if you clean it after some months. There's no overheating issue with it and getting a pc of this configuration at really cheap price is really a big thing. I would say you should buy a warrent for this pc which will help you even more if you get any issue with the pc. I'll say you should really buy this."},{"title":"Its some ports are not working (VGA, 1 HDMI, C type)","date":"Reviewed in India on 22 January 2023","rating":"4.0 out of 5 stars","text":"Its some Ports (VGA, 1 HDMI, C type)...."},{"title":"For full HD gaming , this beats the competition...","date":"Reviewed in India on 14 February 2023","rating":"5.0 out of 5 stars","text":"Got it for approx 67k..... stupendous deal....started with a plague tale requiem....on full HD and ultra settings.....dlss on balanced mode....gave constant more than 60 fps.....and then afterwards tried few other demanding titles....it chews them for breakfast.....for the price I got.it , the competition is left miles behind..... Maybe sometime later.i might change the PSU.....as of now it's bang on for the bucks.....P.S. initially was planning for either PS5 or x series'X.....but sanee head prevailed and i got this hardcore.machine...."},{"title":"Bang for Buck","date":"Reviewed in India on 29 September 2022","rating":"5.0 out of 5 stars","text":"Edit: It's really a VFM product for gamers and content creators. The individual components themselves cost about 75K and if you include windows it goes upto 85K. So, buy it till stock lasts. I brought it for 66K with coupon and card offer ;)Pros:1. Ryzen 5600G is a powerful 6 core processor upto 4.4GHz. it's perfect for CPU demanding applications.2. RTX 3060 12GB is a sweet spot for 1440p gaming. Majority of games will run at high settings even at 1440p. 1080p gaming would be a breeze.3. PC is compact and not as big as a regular gaming pc. Cooling is also not an issue with 3 fans.4. 16GB ram is again a sweet spot for majority of people. 95% of the time you wouldn't need more than that.5. The PC is quite even during gaming. I monitored GPU temparatures during mafia definitive edition gameplay and it didn't cross 55 degrees.Cons:1. Design is a bit dull. It does not have RGB or anything to feel like a gamer. But in a way the stealth design is good.2. 512 GB of SSD is a bit low considering the size of games these days. You won't be able to install more than 3-4 games at a time.3. The motherboard used is a cheap one. It does the job but it's not future proof with only 2 slots of RAM and 1 slot for SSD and HDD.4. PSU is rated 380W which is bare minimum for a combination of 5600G and 3060. You can't overclock it as it can't handle high power."},{"title":"Couldn't be better","date":"Reviewed in India on 15 November 2022","rating":"5.0 out of 5 stars","text":"Bought this in diwali sale got it almost for 68k played almost every popular game and it's been satisfactory experience. These are the games I have tried.Gta V --- Very High ------- +65fpsApex Legends -- low with tsaa and 2x filtering ---- +215fpsValorant -- low settings ---- +300fpsoverwatch2 --- low settings --- 300fpscyberpunk77 --- ultra raytracing --- +55fpswarzone --- medium settings --- 120fps - 144fpsYOU WON'T GET MUCH FRAME RATE DROP WHILE USING OBS JUST MINIMAL 20-30FPSONLY THING THAT YOU SHOULD KNOW ABOUT THIS PC IT IS COMPACT AND IT HEATS KINDA FAST IT AND POWER SUPPLY IS ALSO ONLY LOW FOR A PC WITH THIS SPECS.OVERALL IT'S WORTH IT ONLY IF YOU GET IT FOR LESS THAN 70000"},{"title":"Best deal for the price","date":"Reviewed in India on 23 October 2022","rating":"4.0 out of 5 stars","text":"The overall package is the best deal for the price. I still have my doubts about the power supply but so far it's doing ok. Comes with 3 months if game pass ultimate as well as a 3 year warranty so I don't have many complaints."},{"title":"Heating issue, better buy a custom built.","date":"Reviewed in India on 19 January 2023","rating":"3.0 out of 5 stars","text":"Having too much of heating issue, and not enough room for cooling for the CPU. temperatures reaching high as 100C. performance is good."}],"_id":"6458d7f9e046597d8732b812"},{"name":"Electrobot Gaming Tower PC - Ryzen 3500X, RTX 2060 6GB, 16GB RAM, 1TB HDD, 240GB SSD with 3 RGB Cooling Fans with Controller (Ryzen 5 3500X)","imgUrl":"https://m.media-amazon.com/images/I/41DonqtMERL._SY300_SX300_QL70_ML2_.jpg","reviews":[{"title":"Good Build. Great components. Amazing Ryzen 5 build.","date":"Reviewed in India on 6 August 2020","rating":"5.0 out of 5 stars","text":"*** Order & Delivery ***Ordered on 17th June 2020 & got it delivered on 21st June. This was earlier than the 24th June expected delivery date. Kudos to that to the seller & amazon delivery team.*** Packaging ***While tracking, I found that this was shipped from Delhi then taken to Gurgaon, then to Mumbai (Bhiwandi) & then I got the package. The packaging was amazing. They had packed the CPU in 2 boxes (CPU box with thermocol & extra packaging box). Internally too they had placed lots of paper so that the internal components don't move much in transit.The package received was in very good condition.*** CPU Build Components ***CPU: AMD Ryzen 5 - 3600 (6core 12threads)GPU: Galax Nvidia RTX 2060 - 6GB (seems to be the \"white Mini\" version)RAM: XPG Adata GAMMIX 16GB (single stick - 3000MHz)Motherboard: Gigabyte B450M DS3HStorage-1: Western Digital - WD Green 240GB M.2 SSD  [Product-ID: WDS240G2G0B]Storage-2: Western Digital - WD Blue 1TB (6Gb/s Sata, 7200rpm, 64MB Cache)  [Product-ID: WD10EZEX]Cabinet: Aerocool SI-5200 RGB MidTower (with 3RGB front fans)+ A Wifi Mini USB adapter (this was a surprise )*** My Buying reason ***I build my own PCs by going to Lamington road, Mumbai. Just earlier In Jan 2020, I have built a Ryzen 7 3700x powered system. But due to this pandemic lockdown had to reluctantly order online. I already know how powerful these 3rd gen (zen 2) Ryzen processors are.I needed this for my spouse who needs to run heavy architecture related design & 3D rendering softwares.*** Review (6th August 2020 - nearly 6weeks of use) ***This R5 3600 processor is already a powerful workhorse & competes with i7 8700k. Only in (high fps) gaming will it loose to the mentioned intel counterpart. But overall usage wise, this processor is absolute VFM product.Electrobot team has built this system nicely (a very clean built). The product is amazing. No complaints there.Owning a Ryzen 7 system already, I found your configuration with Ryzen 5 fair at the price of Rs.74,135 (the price i purchased this system at).The system is smooth. Components used are good (wont say great necessarily), but yes, they are sufficient & are working smoothly. Haven't heard any negatives yet, but I am skeptical about the Galax GPU card.In all, a great & efficient system. Thanks to the Electrobot team.*** Suggestion to Electrobot team ***1. RAM- Modern CPUs (especially AMD ones) work better in dual-channel RAM configurations.- So instead of a single 16GB stick, 2 x 8GB sticks would have been appreciated.2. Cabinet- I know, gaming cabinets & RGB bling is needed for you guys to sell, but this case lacks airflow. It just has no airflow.- This Ryzen 5 sits around 60-65c, whereas my Ryzen 7 system sits at 45-50c with their respective stock coolers (idle).- I understand, that these modern CPUs are slated at max operating temperatures of 100-105c. but still airflow cases are much appreciated.- But have to say, The cabinet is funky & really looks cool.*** Final Conclusion ***I am an engineer & my technicality might result into nit-picking, but its a great product at the mentioned cost.The whole packaging, delivery (due to this lockdown) & the performance of system received, has been amazing.This is the first time, I am owning a pre-built system, bought online and I am very happy with the product."},{"title":"Nice gaming pc very good for gaming","date":"Reviewed in India on 17 April 2022","rating":"5.0 out of 5 stars","text":"I bought this about a week ago and it's good for gaming but I didn't get the hdd with it and there was no space to add a new hdd so i had to go with SSD option there is only space for SSD and i played gta 5, valorant, Minecraft and cities skylines everything is smooth and it can handle these games pretty well the only thing I am not ok about is that they scammed with the HDDEdit: they actually did not scam with the HDD it's just that they forgot to connect it properly so i changed it to 5 stars and it's a loss for me because I bought an SSD and then only I saw this but it's ok good gaming pc"},{"title":"Warrenty problem?","date":"Reviewed in India on 31 July 2021","rating":"2.0 out of 5 stars","text":"i have purchased this pc 1 year ago but after 1 year problem occurs in gpu but they said onsite warrenty is not availiable. i don't know what to do ?"},{"title":"AMAZING COMPUTER","date":"Reviewed in India on 2 February 2021","rating":"5.0 out of 5 stars","text":"I never bought a pre-built pc,But this is available at a great price of 72K.I wanted something to game on and also the RTX tech for rendering, it's really next gen.Electrobot did an amazing job, everything was up and running, packaged really well.It got what it says, all parts are original and of good brands.RAN all CPU and GPU tests, stressed them hard..This is a powerful rig.This can run all latest games at ultra (without RTX on) but when using rendering softwares, that's where you will get the edge, though it's a entry level RTX card, still a lot for rendering and CAD softwares."},{"title":"using the PC for 1 year","date":"Reviewed in India on 12 July 2022","rating":"5.0 out of 5 stars","text":"An excellent product. No major issues as of now after using it for 1 year."},{"title":"HDMI is not working","date":"Reviewed in India on 15 June 2021","rating":"4.0 out of 5 stars","text":"The hdmi output is not working"},{"title":"Really good product !!","date":"Reviewed in India on 15 January 2021","rating":"5.0 out of 5 stars","text":"Just got it 2 days ago... It's really good and I am just amazed by its performance. Nice work electrobotComponents I Got --Asrock mother board - asrock b450m ac which already have inbuilt WiFi and Bluetooth ..-T-force vulcanz 16gb x1 ram-Galax RTX 2060-Ryzen 3600"}],"_id":"6458d7fee046597d8732b813"},{"name":"Portable Webcam 480P 30fps Camera with Mount Clip Built-in Micropne Notebook Laptop PC Desktop Computer Web Camera USB Plug & Play for Online Conferences Meeting Call Live Streaming","imgUrl":"https://m.media-amazon.com/images/I/31b8N0nnHpL._SX300_SY300_QL70_ML2_.jpg","reviews":[],"_id":"6458d803e046597d8732b814"}]