[{"name":"ASUS ROG Strix G10CE, 6 core Intel Core i5-11400F, Gaming Desktop (8GB/1TB HDD + 512GB SSD/4GB NVIDIA GeForce GTX 1650 Graphics/Windows 11/Gray/8 Kg), G10CE-51140F244W","imgUrl":"https://m.media-amazon.com/images/I/11s5GBnzDfL._QL70_ML2_.jpg","reviews":[],"_id":"6458d7e5e978344e68f0281d"},{"name":"Lenovo Legion Tower 5 Gaming Desktop (AMD Ryzen 7 5800/16GB/512GB SSD/2TB HDD/Win11/NVIDIA RTX 3070 8GB GDDR6/Legion ColdFront 2.0 Cooling/ARGB Lighting with 16 Million Colors/Transparent Side Panel)","imgUrl":"https://m.media-amazon.com/images/I/41UTOG8kqZL._SX300_SY300_QL70_ML2_.jpg","reviews":[{"title":"No C Type usb Display","date":"Reviewed in India 🇮🇳 on 1 March 2023","rating":"4.0 out of 5 stars","text":"Awesome ProductOnly drawback is No C Type usb Display"},{"title":"PC is beast with cpu thermals issue and Lenovo support issue","date":"Reviewed in India 🇮🇳 on 23 October 2022","rating":"5.0 out of 5 stars","text":"My complaint is only on incompetent Lenovo support . They have no idea on how to support this productIf you have an issue with the PC . You are done for"},{"title":"Waiting for the Price Drop?","date":"Reviewed in India 🇮🇳 on 10 September 2022","rating":"5.0 out of 5 stars","text":"I'm in kinda dilemma in choosing PS5  or PC. But, after watching YouTube comparisons, I finally chose this Beast! X"},{"title":"Beware guys before purchasing","date":"Reviewed in India 🇮🇳 on 16 January 2022","rating":"1.0 out of 5 stars","text":"This model have LHR edition RTX3070 which is not mentioned anywhere in the description or title, this is very misleading ."},{"title":"I can't think of a better product in this price range","date":"Reviewed in India 🇮🇳 on 15 January 2022","rating":"5.0 out of 5 stars","text":"During this chip shortage, this seems to be the best deal, at this price. I will recommend it to anyone with this budget.👍"}],"_id":"6458d7ebe978344e68f0281e"},{"name":"Crucial RAM 8GB DDR4 3200MHz CL22 (or 2933MHz or 2666MHz) Laptop Memory CT8G4SFRA32A","imgUrl":"https://m.media-amazon.com/images/I/51esjcOy79L._SY300_SX300_QL70_ML2_.jpg","reviews":[{"title":"Works amazing on my Zephyrus G15 GA503, gets the job done flawlessly","date":"Reviewed in India on 1 May 2023","rating":"5.0 out of 5 stars","text":"The G15 Ga503 comes with 8gb soldered and 8gb replaceable ram.So the max we could go is 24 gigs on our Indian version of this laptop (as motherboard supports 32gbs max)My work needs require me to open 50+ tabs on different browsers, loads of excel sheet and Photoshop.This led to my File Explorer lagging and crashing sometimes even after having 16gb of ram.After I put on this ram, I noticed during heavy usage, my RAM usage reaches out around 20-21gbs which is now handled perfectly by the system.Anyone looking to add a 16 gb ram along with a 8gb soldered ram, please don't be worried about the dual channel function of the ram; till 16gbs, both the rams will still work in dual channel, just the last 8 gb ram will work as a single channel which you wouldn't even notice."},{"title":"Worth buying","date":"Reviewed in India on 2 May 2023","rating":"4.0 out of 5 stars","text":"Worth buying I purchased at Rs.3389 but now its Rs.3299. Time on delivery, easy to install. I have now 20GB RAM capacity 16GB+4GB. The only drawback is its not 3200MHz. Its still have 2133MHz speed for me."},{"title":"Excellent 16GB RAM upgrade for ASUS TUF Gaming F15","date":"Reviewed in India on 17 April 2023","rating":"5.0 out of 5 stars","text":"I recently upgraded my ASUS TUF Gaming F15 ( FX566HCB-HN231T ) laptop with this 16GB RAM and it has been a fantastic addition to my machine. Before purchasing, I verified the compatibility of this product with the ASUS support team and they gave me the green light. I was a bit hesitant at first, but I am glad I took the plunge.With the added 16GB of RAM, my laptop now has a total of 24GB and it works smoothly without any lags or hiccups. The installation process was quick and easy, and it was recognized by my laptop right away. I can now run multiple programs and heavy applications with ease, without worrying about any performance issues.The product quality is top-notch and I am extremely happy with my purchase. This RAM is a perfect fit for my ASUS TUF Gaming F15 laptop and has helped to enhance its performance significantly. If you are looking for an excellent upgrade for your laptop, I highly recommend this 16GB RAM.Overall, I am extremely satisfied with this purchase and would definitely give it a 5-star rating. It has exceeded my expectations and has made a huge difference in the performance of my laptop."},{"title":"Buy Kit or (8*2) (16*2) for proper","date":"Reviewed in India on 9 March 2023","rating":"4.0 out of 5 stars","text":"if you thinking about upgrade ram then you should go with 8+8 gb ( 2 sticks of 8 gb) minimum for multitasking.this 3200 mhz ram is compatible with higher and lower model also.this is very important to have for dual channel:- ( Both ram )1. Same capacity  (8+8, 16+16, 32+32...)2. Same frequency ( 3200mhz +3200mhz)that's properly work with dual channel and maximize memory bandwidth.profit of dual channel :1.  Cpu process larger data transfer  that's division to multiple sequence at the same time that's why performance increase.2. CPU does not wait for Processing because of it's have option to send that process to dual mode that's why performance increase.3. Switching between application data stored in rame cache that's help to change tab easily.if you have 4 gb in your system that's i recommend you to replace it 8 + 8 gb  two ram stick . it's more helpful to you ( do not go with 4+2=6gb, 12gb,20gb,24gb and en even frequency).And next upgradation to go with SSDfirst preference to M.2second if slot not available replace hdd to SSD ( minimum 512 GB recommend)"},{"title":"Great product as per description","date":"Reviewed in India on 16 April 2023","rating":"4.0 out of 5 stars","text":"Working well with proper 3200mhz frequency"},{"title":"normal","date":"Reviewed in India on 6 April 2023","rating":"4.0 out of 5 stars","text":"This product is work normally, cause my previous Ram has 2400MHz and this Ram Has 3200MHz frequency and those are same speed"},{"title":"Works fine but watch a video on how to insert it properly.","date":"Reviewed in India on 24 April 2023","rating":"5.0 out of 5 stars","text":"Works fine with my MSI GF 76 laptop.Went from 8gb to 16 gb ram. Just one advice - watch a video on how to insert it properly. Before my first attempt, I did not watch the video and inserted it incorrectly and ofc system did not recognise it. Afterwards I was successful after watching a video on YouTube."},{"title":"Great price for 64GB","date":"Reviewed in the United Kingdom on 26 November 2022","rating":"5.0 out of 5 stars","text":"If you're looking to buy, this is a great product. bought as I was gonna be cleaning my laptop fans anyway so why not double the RAM while I am in there.A few points for people thinking to buy:1. This is DDR4 SODIM ram so make sure that your board is compatible2. Some RAM is soldered in and cannot be replaced.3. Lookup your laptop and find where the RAM is before you start (Youtube teardown videos are usually good)4. Check how many RAM sockets you have as some laptops only have 1. you most likely have 2Before you start:1. Remove any wool or nylon clothing (static is a huge killer of laptops)2. Remove any headphones or things dangling down3. make sure your work area is as clear as possible and you have a small pot for any screwsTo install:1. After locating the RAM slots you will see 2 silver (or black) clips, one either side of the chip. Gently pull these out to the side until the old RAM chip pops up.2. Remove the old chip and put it somewhere safe (avoid anything that can conduct static)3. Remove the new stick out of its packaging, avoid touching the golden teeth (not the end of the world if you do, just good practice).4. Insert the RAM into the socket at a 45 degree angle making sure to line up the gap in the bottom to the notch in the socket.5. gently press down until you hear the lips click into place.While you're in there you may as well give the fans a clean. remove as much dust as you can, Compressed air and/or a microfiber brush is good for this."},{"title":"CT2K8G4SFRA32A bundle is two CT8G4SFRA32A sticks. The CT8G4SFRA32A is x8 bank grouped","date":"Reviewed in the United Kingdom on 12 September 2021","rating":"5.0 out of 5 stars","text":"I have successfully upgraded my Dell Inspiron 16 Plus 7610 to 16GB using the CT2K8G4SFRA32A bundle.The CT2K8G4SFRA32A bundle contained two CT8G4SFRA32A.M8FRS memory modules.The HWINFO64 tool reports that the CT8G4SFRA32A module is single rank with 4 bank groups. So the module is in a R1x8 configuration. It's not the cheaper and slower R1x16 rank and bank configuration being sold with many laptops at the moment. I'm sharing this info as I couldn't find any technical specification data online about the bank group configuration prior to making the purchase."},{"title":"Crucial RAM 16GB DDR4 3200MHz CL22 CT16G4SFRA32A runs in Asustor AS66064T NAS ABOVE Spec Incl SPD","date":"Reviewed in the United Kingdom on 26 November 2022","rating":"5.0 out of 5 stars","text":"x2 Crucial RAM 16GB DDR4 3200MHz CL22 CT16G4SFRA32A Works as expected, Arrived next day, Cheap at a little over £30. This Seller Answered my query quickly (Extra star there!) Product arrived in a semi-tamper proof sealed package. Brand spanking new New! (not repackage)I Will buy Micron/Crucial IC again..Ok, The Crucial RAM 16GB DDR4 3200MHz CL22 CT16G4SFRA32A***  Part number: 8ATF2G64HZ-3G2F1  ***I Could'nt figure out if it is 1R or 2R - Single/Double RankUnder CPUz it states \"Single Rank\" but IDK if that is because I only have a Single DIMM stick installed in the system I am checking **OR** if it means this product is a Single Row/Dual Rank + I have a Single Module installed, there is a difference??Two separate Devices, Two Stick of Crucial RAM 16GB DDR4 3200MHz CL22 CT16G4SFRA32A memory.Device #1 NAS============I Just swapped out single 4GB stick for this Single 16GB DDR4 Stick (Plus I reinstalled the original 4GB DDR4 stick for a 20GB DDr4 total Mixed brands) into Asustor AS66064T NAS.Can confirm Asustor NAS can definitely handle higher than 8GB DDR4 ram and will run above Asustor spec's quite stabile under heavy load/stressed.Device #2 Mini PC==============Another separate 16GB stick of RAM (Crucial RAM 16GB DDR4 3200MHz CL22 CT16G4SFRA32A) used to replace old 8GB module works quite happily inside a B310 MoBo / NVIDIA GeForce GTX 1660 Ti (TU116) GPU based Gaming Rig. (24GB DDR4 Total)Memory Timings SPDCPUz Dump==========Here is a dump from CPUz RAM Timings + SPD. Hope this help'sMemory Type  DDR4Memory Size  16 GBytesChannels  SingleMemory Frequency  21.0 MHz (1:20)CAS# latency (CL)  22.0RAS# to CAS# delay (tRCD) 22RAS# Precharge (tRP)  22Cycle Time (tRAS)  52Row Refresh Cycle Time (tRFC) 560Command Rate (CR)  2TUncore Frequency  59.9 MHzHost Bridge  0x3EC2DIMM #  1 SMBus address  0x50 Memory type  DDR4 Module format  SO-DIMM Module Manufacturer(ID) Micron Technology (2C00000000000000000000) SDRAM Manufacturer (ID) Micron Technology (2C00000000000000000000) Size  16384 MBytes Max bandwidth  DDR4-3200 (1600 MHz) Part number  8ATF2G64HZ-3G2F1 Serial number  3A31E734 Manufacturing date Week 31/Year 22 Nominal Voltage  1.20 Volts EPP  no XMP  no AMP  noJEDECtimings table  CL-tRCD-tRP-tRAS-tRC @ frequency JEDEC #1  10.0-10-10-24-34 @ 727 MHz JEDEC #2  11.0-11-11-26-37 @ 800 MHz JEDEC #3  12.0-12-12-28-40 @ 872 MHz JEDEC #4  13.0-14-14-31-44 @ 945 MHz JEDEC #5  14.0-14-14-33-47 @ 1018 MHz JEDEC #6  15.0-15-15-35-50 @ 1090 MHz JEDEC #7  16.0-16-16-38-54 @ 1163 MHz JEDEC #8  17.0-17-17-40-57 @ 1236 MHz JEDEC #9  18.0-18-18-42-60 @ 1309 MHz JEDEC #10  19.0-19-19-45-64 @ 1381 MHz JEDEC #11  20.0-20-20-47-67 @ 1454 MHz JEDEC #12  21.0-21-21-49-70 @ 1527 MHz JEDEC #13  22.0-22-22-52-74 @ 1600 MHz JEDEC #14  23.0-22-22-52-74 @ 1600 MHz JEDEC #15  24.0-22-22-52-74 @ 1600 MHzHope this helps"},{"title":"Funciona perfectamente con la HP OMEN 15-ek0012la Intel Core i7","date":"Reviewed in Mexico on 18 May 2021","rating":"5.0 out of 5 stars","text":"El producto llegó rápido, compré la RAM de 8 GB, esperando complementar la que actualmente tiene mi PC y tener un total de 16 GB. Tenía dudas y temores de que no funcionara, sin embargo hice el pedido, instalé en menos de 15 minutos y sin necesidad de reboot, al encender la PC automáticamente estaba reconocida.Algunos datos importantes para futuros compradores:1. Tengo una Laptop OMEN 15 EK0012LA2. El procesador es un Intel® Core™ i7-10750H (por si tenían duda si funcionaba con procesadores intel)3. Funciona en canal dual a la perfección, en conjunto con la RAM que tenía mi ordenador de fábrica, la cual NO es marca Crucial. Entonces, si tenían preocupaciones respecto a \"mezclar\" marcas de RAM, la respuesta es: no hay ningún problema4. Según las especificaciones del fabricante, mi capacidad instalada de velocidad es 2933 Mhz, yo compré la Crucial de 3200, lo que pasa es que se ajusta a la velocidad máxima instalada. Es decir, corre en canal dual a 2933 sin mayor problema5. A nivel funcional, honestamente a 1 mes de compra veo poca diferencia. Sin embargo sí noto que responde mejor cuando saturo de programas y tareas la laptop. Yo la uso para correr progrmaas en python, matlab y estar trabajando a la vez en paquetería de oficina como Excel, Outlook, Notion y el navegador por su puesto."}],"_id":"6458d7f1e978344e68f0281f"},{"name":"XPG ADATA GAMMIX D30 DDR4 8GB (1x8GB) 3200MHz U-DIMM Desktop Memory - AX4U32008G16A-SR30","imgUrl":"https://m.media-amazon.com/images/I/41r-kUJeA3L._SX300_SY300_QL70_ML2_.jpg","reviews":[{"title":"Ram is very good","date":"Reviewed in India on 6 May 2023","rating":"5.0 out of 5 stars","text":"I am happy with this ram it is very fast and It have 5 years warranty this is very good choice so buy this ram"},{"title":"Looking good","date":"Reviewed in India on 6 April 2023","rating":"4.0 out of 5 stars","text":"Looking good"},{"title":"Osm","date":"Reviewed in India on 5 April 2023","rating":"4.0 out of 5 stars","text":"Nice"},{"title":"Ram is very powerful because it has latency cl 16-20","date":"Reviewed in India on 3 May 2023","rating":"5.0 out of 5 stars","text":"I like the ram ,it's design and performance andBest thing I like is design 👍👍👍😍😍"},{"title":"Best!","date":"Reviewed in India on 3 May 2023","rating":"5.0 out of 5 stars","text":"Best quality and gives a good performance and look to your PC ."},{"title":"Best deal forever","date":"Reviewed in India on 5 May 2023","rating":"5.0 out of 5 stars","text":"It is superb product working very smoothly"},{"title":"amazing product","date":"Reviewed in India on 5 May 2023","rating":"5.0 out of 5 stars","text":"its perfectly worth"},{"title":"Good","date":"Reviewed in India on 26 March 2023","rating":"4.0 out of 5 stars","text":"Working ferfectly"}],"_id":"6458d7f7e978344e68f02820"},{"name":"Corsair Vengeance LPX 8GB (1x8GB) DDR4 3200MHZ C16 Desktop RAM (Black)","imgUrl":"https://m.media-amazon.com/images/I/41mSGMeopsL._SX300_SY300_QL70_ML2_.jpg","reviews":[{"title":"Quick work","date":"Reviewed in India 🇮🇳 on 1 May 2023","rating":"4.0 out of 5 stars","text":"It's running but slight slow.  I am satisfied"},{"title":"Good Product","date":"Reviewed in India 🇮🇳 on 13 April 2023","rating":"4.0 out of 5 stars","text":"Have purchased earlier also.  Good product."},{"title":"Qorth it","date":"Reviewed in India 🇮🇳 on 28 March 2023","rating":"4.0 out of 5 stars","text":"I would say its good for multitasking if you are only using sigle 1x16 stick you have to overclock the ram from bios to 3200mhz to use max speed of ram else its good."},{"title":"Good","date":"Reviewed in India 🇮🇳 on 11 April 2023","rating":"4.0 out of 5 stars","text":"Good for this pricing"},{"title":"Great value for money","date":"Reviewed in India 🇮🇳 on 3 May 2023","rating":"5.0 out of 5 stars","text":"I've paired it with my older RAM and it's been working like a charm for one month under heavy usage."},{"title":"Update","date":"Reviewed in India 🇮🇳 on 26 April 2023","rating":"5.0 out of 5 stars","text":"Ram wasn't faulty. CMOS was the problem. Thanks"},{"title":"Its my favourite apps","date":"Reviewed in India 🇮🇳 on 27 April 2023","rating":"5.0 out of 5 stars","text":"Excellent"},{"title":"Best performance","date":"Reviewed in India 🇮🇳 on 22 April 2023","rating":"5.0 out of 5 stars","text":"Best performance"},{"title":"Stable D.O.C.P in ryzen","date":"Reviewed in the United Kingdom 🇬🇧 on 16 August 2020","rating":"5.0 out of 5 stars","text":"Great ram to pair with a current ryzen build, I didn't have to manually tweak the MHz with my motherboard, I just had to select DOCP profile 1 and it is nice and stable. The ram gives a noticeable improvement for my ryzen 5 2600x build, there is a bit of a boost in fps and smoothness , little less input lag occurrences across the games I have been playing as well.I picked two of these up separately and both are working flawlessly with no issues in my current sff build. The heatshroud I'm sure is benefiting these in the compact case.C16 and in my experience great ryzen compatibility have made this the perfect choice for me at the moment - 3000mhz is doing the job. Id advise you to be sure that you have your ram speed set correctly in the bios to be sure you get the most out of this stick or just enable d.o.c.p there."},{"title":"Fast and reliable Ryzen RAM","date":"Reviewed in the United Kingdom 🇬🇧 on 18 December 2019","rating":"5.0 out of 5 stars","text":"I am using this RAM in my Ryzen system and with the XMP enabled in the bios I have been running them at 3000Mhz reliably on an Asrock B450 motherboard.16GB is ideal for gaming and I have noticed a performance gain moving from 8 to 16GB of vengeance.The RAM stays cool with their metal heat sync covers and have been running reliably for me for a couple of weeks now.Corsair is my go to brand of RAM and I have always had a great experience with using them over the competition.Highly recommended for gamers looking to spice up their rig with some high speed RAM."},{"title":"Works well, decent value","date":"Reviewed in the United Kingdom 🇬🇧 on 25 September 2022","rating":"4.0 out of 5 stars","text":"bought this as my old ram sticks died (Just stopped working after about 2 years, not overclocked or under constant intensive use or anything) and this RAM seems to work better (its faster and more stable - pc just runs slightly smoother with it) so happy so far- hopefully this RAM stick will last more than just two years"},{"title":"Check specs for overclocking","date":"Reviewed in the United Kingdom 🇬🇧 on 5 February 2021","rating":"4.0 out of 5 stars","text":"Different timings to another stick of RAM I have which is same make and model, i expected this one to be identical but it isn't. It seems to be an older version with lower specs. Not ideal for overclocking. Check timing numbers match if you plan to overclock to max potential"},{"title":"Works and running settings","date":"Reviewed in the United Kingdom 🇬🇧 on 24 May 2020","rating":"5.0 out of 5 stars","text":"Running in Asus Tuf B350M Plus Gaming Mother Board with Athlon 3000G CPU ( £46 CPU ) at 4.00 Ghz, the ram is 8Gb at 3000 Mhz but running at 3200 Mhz and stable, only a desk top PC and not use for gaming, using it for 2d and 3d Cad, upgraded the cooling fan and heat sink to Wraith Stealth from Ryzen CPU, idle temp 26 Deg, 65 Deg on stress test, this is a cheap as chips PC."}],"_id":"6458d7fce978344e68f02821"},{"name":"HTC18 Cord Organizer, 4 Slots Bamboo Stand Multi-Device Desktop Cords Organizer Dock Charging Station Holder with Built-in Insert Slots for Smartphones, Tablets and Laptops","imgUrl":"https://m.media-amazon.com/images/I/41fpKi5FKCL._SX300_SY300_QL70_ML2_.jpg","reviews":[],"_id":"6458d801e978344e68f02822"}]